[{
    "id": "AD",
    "name": "Andorra"
},
{
    "id": "AE",
    "name": "United Arab Emirates",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter United Arab Emirates.\n- This does not apply to nationals of Bahrain, Kuwait, Oman, Saudi Arabia and United Arab Emirates.\n- This does not apply to passengers with a diplomatic passport.\n- This does not apply to family members (including father, mother, son, daughter, wife, husband, grandparents, grandchildren and domestic helpers) of nationals of United Arab Emirates. They must travel together. Airlines are required to contact the local immigration for prior approval before boarding.\n2. Visas issued before 17 March 2020 by United Arab Emirates have been invalidated.\n3. Passengers arriving from Italy must have departed from Fiumicino (FCO) or Ciampino (CIA). All passengers and crew must go through a COVID-19 screening process. \n4. Passengers arriving from China (People's Rep.) must have departed from Beijing (PEK). All passengers and crew must go through a COVID-19 screening process.\n5. Nationals of the United Arab Emirates are allowed to enter with a national ID card if they left before 28 February 2020. \n6. Nationals of Bahrain, Kuwait, Oman and Saudi Arabia are no longer allowed to enter the United Arab Emirates with a national ID card, they must have a passport. \n7. Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Iran or Thailand. \n8. Passengers arriving on a direct flight at Abu Dhabi (AUH) from Italy, Lebanon and Syria must go through a COVID-19 screening process and obtain a proof of screening slip before continuing to Immigration."
},
{
    "id": "AF",
    "name": "Afghanistan"
},
{
    "id": "AG",
    "name": "Antigua and Barbuda",
    "bans":{"AT":-28, "BE":-28, "BL":-28,"CA":-28, "CN":-28, "HR":-28, "CY":-28, "CZ":-28, "DK":-28, "EE":-28, "FI":-28, "FR":-28, "DE":-28,
      "GR":-28, "HU":-28, "IS":-28, "IR":-28, "IE":-28, "IT":-28, "KR":-28, "LV":-28, "LI":-28, "LT":-28, "LU":-28, "MT":-28, "NL":-28, "NO":-28, "PL":-28, "PT":-28,
      "RO":-28, "SG":-28, "SK":-28, "SI":-28, "ES":-28, "SE":-28, "CH":-28, "US":-28, "GB":-28},
    "nationalsExcempt":true,
    "tooltip":"1. Passengers and airline crew who have been in Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, USA or United Kingdom in the past 28 days are not allowed to enter Antigua and Barbuda.\n- This does not apply to nationals of Antigua and Barbuda and resident diplomats. \n2. Airlines must provide advance passenger information of scheduled arrival of nationals of Antigua and Barbuda and resident diplomats."
},
{
    "id": "AI",
    "name": "Anguilla"
},
{
    "id": "AL",
    "name": "Albania",
    "nationalBans":["*"],
    "tooltip":"Flights to Albania are suspended.\n- This does not apply to flights operated by Air Albania (ZB) from/to Istanbul (IST)."
},
{
    "id": "AM",
    "name": "Armenia",
    "nationalRestrictions":["CN", "IR"],
    "bans":{"AT":-14, "BE":-14, "CN":-14, "DK":-14, "FR":-14, "DE":-14, "IR":-14, "IT":-14, "JP":-14, "KR":-14, "NL":-14, "NO":-14, "ES":-14, "SE":-14, "CH":-14, "GB":-14},
    "tooltip": "1. Nationals of China (People's Rep.) with a normal passport are no longer visa exempt. \n2. Nationals of Iran can no longer obtain a visa on arrival. They must obtain a visa or an e-visa prior to their arrival in Armenia. The e-visa can be obtained at https://evisa.mfa.am/ \n3. Passengers who have been in Austria, Belgium, China (People's Rep.), Denmark, France, Germany, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland or United Kingdom in the past 14 days are not allowed to enter Armenia.\n\n- This does not apply to nationals or residents of Armenia.\n\n- This does not apply to spouses or children of nationals of Armenia.\n\n- This does not apply to employees of foreign diplomatic missions and consular institutions.\n\n- This does not apply to representations of official international missions or organizations.\n\n4. Nationals of Armenia who have been in Austria, Belgium, China (People's Rep.), Denmark, France, Germany, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland or United Kingdom in the past 14 days must undergo 14-days of quarantine or self-isolation regime."
},
{
    "id": "AO",
    "name": "Angola",
    "bans": {"CN": -1000, "FR":-1000, "IR": -1000, "IT": -1000, "KR": -1000, "PT":-1000, "ES":-1000},
    "nationalRestrictions":["*"],
    "nationalsExcempt": true,
    "tooltip":"1. Passengers and airline crew who have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain are not allowed to enter Angola. This also applies to passengers and airline crew who have been in contact with people infected by the Coronavirus (COVID-19).\n- This does not apply to airline crew and nationals of Angola. \n2. Residents of Angola, airline crew and nationals of Angola who arrive from or have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain will be put in quarantine. \n3. A completed sanitary control sheet must be presented to the National Directorate of Public Health of the Ministry of Health upon arrival."
},
{
    "id": "AQ",
    "name": "Antarctica"
},
{
    "id": "AR",
    "name": "Argentina",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"Passengers are not allowed to enter Argentina."
},
{
    "id": "AS",
    "name": "American Samoa"
},
{
    "id": "AT",
    "name": "Austria",
    "restrictions":{"CN":-14, "FR":-14, "IT":-14, "IR":-14, "KR":-14, "ES":-14, "CH":-14},
    "tooltip":"Passengers and crew members who have been in Hubei Province of China (People's Rep.), France, Italy, Iran , Korea (Rep.), Spain or Switzerland in the past 14 days must have a medical certificate dated from a maximum of 4 days before their arrival in Austria. The medical certificate must :\n- confirm that the person is not affected by Coronavirus (COVID-19), and\n- be in German or in English, and\n- be obtained at https://infothek.bmvit.gv.at/massnahmen-bei-der-einreise-aus-sars-cov-2-risikogebieten/ .\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland.\n- This does not apply to passengers with a British passport.\n\n- This does not apply to crew members of cargo, emergency, rescue/ambulance or ferry flights."
},
{
    "id": "AU",
    "name": "Australia",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"1. Passengers are not allowed to transit or enter Australia. \n- This does not apply to nationals of Australia. \n- This does not apply to the immediate family members of nationals of Australia. \n- This does not apply to permanent residents of Australia and their immediate family members. \n- This does not apply to nationals of New Zealand residing in Australia. \n- This does not apply to airline crew.\n- This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members.\n- This does not apply to nationals of Fiji, Kiribati, Marshall Isl., Micronesia (Federated States), Nauru, New Zealand, Niue, Palau, Papua New Guinea, Samoa (American), Solomon Isl., Tonga, Tuvalu and Vanuatu when they are transiting through Australia to their home country.\n- This does not apply to passengers who reside in Cook Isl., French Polynesia or New Caledonia when they are transiting through Australia to their home country. \n2. All passengers are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay.\n- This does not apply to airline crew with the appropriate personal protective equipment. \n3. Nationals of Australia are not allowed to travel out of Australia.\nThis does not apply to the following:\n- Persons ordinarily resident in a country other than Australia; \n- Airline and maritime crew and associated safety workers;\n- Persons engaged in the day to day conduct of outbound and inbound freight;\n- Persons whose travel is associated with essential work at offshore facilities; and\n- Persons travelling on official government business, including members of the Australian Defence Force."
},
{
    "id": "AW",
    "name": "Aruba",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip": "Passengers are not allowed to enter Aruba.\n-This does not apply to residents of Aruba. They must hold an valid Aruban driving license, Aruban ID card or a valid Aruban Health Insurance Card.\n-This does not apply to airline crew.\n-Passengers must apply self-quarantine for 14 days"
},
{
    "id": "AX",
    "name": "Aland Islands"
},
{
    "id": "AZ",
    "name": "Azerbaijan",
    "nationalRestrictions": ["CN", "BH", "ID", "IR", "IL", "JP", "KR", "KW","MY", "OM", "QA", "SA", "AE", "US"],
    "tooltip":"1. Nationals of China (People's Rep.) are not allowed to enter Azerbaijan if they do not have a visa obtained before departure. \n2. Nationals of Bahrain, Indonesia, Iran, Israel, Japan, Korea (Rep.), Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, Singapore, UAE and USA are not allowed to enter Azerbaijan if they do not have a visa obtained before departure."
},
{
    "id": "BA",
    "name": "Bosnia and Herzegovina",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Bosnia and Herzegovina.\n- This does not apply to nationals and residents of Bosnia and Herzegovina.\n- This does not apply to diplomatic and consular staff accredited in Bosnia and Herzegovina.\n- This does not apply to civil servants coming for employment.\n- This does not apply to passengers in need of emergency medical treatment.\n- This does not apply to cross-border workers.\n- This does not apply to civilian protection services and teams.\n- This does not apply to military forces of the NATO and other states participating in the partnership for Peace; and to NATO and EUFOR headquarters in Bosnia and Herzegovina.\n- This does not apply to heads of state and members of their delegations whose arrival and departure has been announced by the competent authority.\n- This does not apply to passengers in transit to return to the country of residence.\n- This does not apply to passengers with a special permit to stay or transit in Bosnia and Herzegovina."
},
{
    "id": "BB",
    "name": "Barbados",
    "restrictions":{"CN":-1, "SCH":-1, "IR":-1, "KR":-1, "GB":-1, "US":-1, "IE":-1},
    "tooltip":"1. Passengers arriving from China's (People's Rep.), Europe, Iran, Korea (Rep.), United Kingdom or USA will be quarantined for 14 days. \n2. Residents of Barbados will be placed in self-quarantine if they are deemed by health authorities to be at low-risk for COVID-19, while all others will be quarantined at a facility."
},
{
    "id": "BD",
    "name": "Bangladesh",
    "restrictions": {"CN":-1, "TW":-1, "HK":-1, "MO":-1, "IR":-1, "IT":-1, "KR":-1},
    "nationalRestrictions": ["*"],
    "tooltip":"1. The visa on arrival facility has been suspended for all nationalities.\n2. Passengers arriving from China (People's Rep.), Iran, Italy or Korea (Rep.) can no longer obtain a visa on arrival. \n3. Passengers arriving from China (People's Rep.), Iran, Italy or Korea (Rep.) with a pre-arranged visa must have a medical certificate stating that the person is not affected by Coronavirus (COVID-19). The certificate must be duly certified by the embassy. \n- This does not apply to nationals of Bangladesh. \n4. Nationals of China (Peoples' Rep.), passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport, a Hong Kong (SAR China) passport or a Macao (SAR China) passport traveling to Bangladesh can no longer obtain a visa on arrival. \n5. Passengers arriving from China (People's Rep.), Chinese Taipei, Hong Kong (SAR China) or Macau (SAR China) must fill-in a Health Clearance Form provided by cabin crew."
},
{
    "id": "BE",
    "name": "Belgium",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Belgium. \n-This does not apply when arriving from Austria, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. \n-This does not apply to nationals of Austria, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland. \n-This does not apply to British nationals; \n-This does not apply to passengers with a long term residence permit or a long term visa issued by EEA Member States, Switzerland or the United Kingdom. \n-This does not apply to:\n- family members of nationals of EEA Member States, Switzerland, and of British nationals;\n- diplomats;\n- personnel of international and humanitarian organizations;\n- humanitarian aid workers; \n- military personnel."
},
{
    "id": "BF",
    "name": "Burkina Faso",
    "nationalRestrictions":["*"],
    "tooltip":"Bobo Dioulasso (BOY) and Ouagadougou (OUA) are closed."
},
{
    "id": "BG",
    "name": "Bulgaria",
    "bans":{"BD":-1, "CN":-1, "FR":-1, "DE":-1, "IN":-1, "IR":-1, "IE":-1, "IT":-1, "KR":-1, "MV":-1, "NP":-1, "NL":-1, "ES":-1, "LK":-1, "CH":-1, "GB":-1},
    "nationalsExcempt":true,
    "tooltip":"Passengers arriving from Bangladesh, China (People's Rep.), France, Germany, India, Iran, Ireland (Rep.), Italy, Korea (Rep.), Maldives, Nepal, Netherlands, Spain, Sri Lanka, Switzerland or United Kingdom are not allowed to enter Bulgaria.\n- This does not apply to nationals of Bulgaria.\n- This does not apply to family members of nationals of Bulgaria.\n- This does not apply to passengers and their families with a permanent or long term residence permit issued by Bulgaria."
},
{
    "id": "BH",
    "name": "Bahrain",
    "bans":{"AT":-14, "BE":-14, "CN":-14, "CZ":-14, "DK":-14, "EE":-14, "FI":-14, "FR":-14, "DE":-14, "GR":-14, "HU":-14, "IS":-14, "IR":-14, "IQ": -14, "KR":-14, "LV":-14, "LI":-14, "LT":-14, "LU":-14, "MT":-14, "NL":-14, "NO":-14, "PL":-14, "PT":-14, "SK":-14, "SI":-14, "ES":-14, "SE":-14, "CH":-14, "GB":-14, "US":-14},
    "restrictions":{"HK":-14, "IT":-14,  "JP":-14, "LB":-14, "MY":-14, "SG":-14, "TH":-14},
    "nationalsExcempt":true,
    "tooltip":"1. Passengers and airline crew who have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Iraq, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom and USA in the past 14 days are not allowed to transit and enter Bahrain. \n\n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates.\n\n- This does not apply to passengers who reside in Bahrain.\n\n- This does not apply to military personnel.\n\n- This does not apply to passengers with a special approval from Nationality, Passport Residence Affairs Directorate of Bahrain.\n\n- This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.\n\n2. Passengers and airline crew who have been in Hong Kong (SAR China), Italy, Japan, Lebanon, Malaysia, Singapore or Thailand in the past 14 days must have a valid visa prior to arrival.\n\n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates.\n\n- This does not apply to passengers who reside in Bahrain.\n\n- This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.\n\n3. Nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, United Arab Emirates who have transited through or have been in Austria, Belgium, China (People's Rep.), Hong Kong (SAR China), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Iraq, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Malaysia, Netherlands, Norway, Poland, Portugal, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, United Kingdom or USA will be subject to quarantine and enhanced testing procedures recommended by the World Health Organization (WHO). \n\n4. Passengers who reside in Bahrain and who have transited through or have been in China (People's Rep.), Egypt, Hong Kong (SAR China), Iran, Iraq, Italy, Japan, Korea (Rep.), Lebanon, Malaysia, Singapore or Thailand will be subject to quarantine and enhanced testing procedures recommended by the World Health Organization (WHO).\n5. Border crossing on the causeway has been temporarily suspended due to Coronavirus (COVID-19)."
},
{
    "id": "BI",
    "name": "Burundi"
},
{
    "id": "BJ",
    "name": "Benin",
    "nationalRestrictions":["*"],
    "tooltip":"Passengers who have been in coronavirus (COVID-19) affected countries are subject to self-quarantine for 14 days."
},
{
    "id": "BL",
    "name": "Saint Barthélemy"
},
{
    "id": "BM",
    "name": "Bermuda",
    "nationalRestrictions":["*"],
    "tooltip":"All passengers must self-quarantine for 14 days when arriving in Bermuda."
},
{
    "id": "BN",
    "name": "Brunei",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to transit or enter Brunei Darussalam.\n\n- This does not apply to nationals and residents of Brunei Darussalam.\n\n2. All visa exemptions and Visa on Arrival are temporarily suspended.\n\n3. All visa issued to passengers are temporarily suspended.\n\n4. Special consideration is only given by the Brunei Immigration Department which is subject to the affairs of interest to Brunei Darussalam by applying to the Brunei Immigration Department by downloading the form provided on the Department’s website at www.immigration.gov.bn"
},
{
    "id": "BO",
    "name": "Bolivia",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Bolivia.\n- This does not apply to nationals of Bolivia.\n- This does not apply to passengers who reside in Bolivia.\n- This does not apply to passengers who are in a diplomatic mission."
},
{
    "id": "BQ",
    "name": "Bonaire, Sint Eustatius and Saba",
    "bans":{"SCH":-1, "GB":-1, "IE":-1, "CN":-1, "CO":-1, "KR":-1, "LI":-1, "US":-1},
    "tooltip":"Passengers arriving from Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Colombia, Croatia, Cyprus, Czechia, Denmark, Dominican Rep., Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or USA are not allowed to enter Bonaire, St. Eustatius and Saba. \n- This does not apply to medical staff and patients who are transferred in the interest of public health on Bonaire, St. Eustatius and Saba."
},
{
    "id": "BR",
    "name": "Brazil",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Brazil. This does not apply to:\n- Nationals of Brazil;\n- Passengers who reside in Brazil;\n- Foreign professionals in a mission in the service of an international body, provided that it is duly identified;\n- Foreign employee accredited to the Brazilian Government;\n- Immediate family member of a national of Brazil;\n- Passengers with an authorization issued by Brazilian Government;\n- Passengers with a National Migration Registry."
},
{
    "id": "BS",
    "name": "Bahamas",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip": "Bahamas borders are closed until 15 April 2020. \n- This does not apply to repatriation flights of foreign nationals from the Bahamas."
},
{
    "id": "BT",
    "name": "Bhutan"
},
{
    "id": "BV",
    "name": "Bouvet Island"
},
{
    "id": "BW",
    "name": "Botswana",
    "bans":{"AT":-1, "BE":-1, "CN":-1, "DK":-1, "FR":-1, "DE":-1, "IN":-1, "IR":-1, "IT":-1, "JP":-1, "KR":-1, "NL":-1, "NO":-1, "ES":-1, "SE":-1, "CH":-1, "US":-1, "GB":-1},
    "nationalRestrictions":["AT", "BE", "CN", "DK", "FR", "DE", "IN", "IR", "IT", "JP","KR","NL","NO","ES","SE","CH","US","GB"],
    "tooltip":"1. Passengers arriving from Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland, USA or United Kingdom are not allowed to enter Botswana.\n- This does not apply to nationals of Botswana.\n- This does not apply to passengers who reside in Botswana.\n2. Nationals and residents of Botswana will be quarantined for 14 days.\n3. Passengers can no longer obtain a visa on arrival in Botswana.. \n4. Visas issued to nationals of Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland or USA are invalidated.\n5. Visas issued to passengers with a British passport with nationality \"British Citizen\" are invalidated."
},
{
    "id": "BY",
    "name": "Belarus"
},
{
    "id": "BZ",
    "name": "Belize",
    "bans":{"SCH":-1, "GB":-1, "CN":-1, "HK":-1, "IR":-1, "JP":-1, "KR":-1},
    "nationalBans":["CN","HK","IR","JP","KR","SCH", "GB"],
    "nationalsExcempt": true,
    "tooltip":"1. Passengers arriving from Europe, China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) are not allowed to enter Belize.\n\n   -This does not apply to nationals and residents of Belize.\n\n2. Nationals of China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) and nationals of European countries are not allowed to enter Belize.\n\n3. Nationals of Belize arriving from China (People's Rep.), Hong Kong, Iran, Japan, Korea (Rep.) or Europe are required to self-isolate for a period of 14 days.\n\n   -This does not apply to airline crew.\n\n4. Residents of Belize arriving from China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) or Europe are required to self-isolate for a period of 14 days."
},
{
    "id": "CA",
    "name": "Canada",
    "bans":{"*":-14},
    "tooltip": "Passengers who were in the cruise ship 'Diamond Princess' are subject to a mandatory 14-day isolation at a quarantine facility upon arrival in Canada. \nPassengers who have been outside of Canada or USA in the past 14 days, are not allowed to enter Canada.\n- This does not apply to nationals of Canada and their immediate family members.\n- This does not apply to permanent residents of Canada.\n- This does not apply to diplomats.\n- This does not apply to airline crew."
},
{
    "id": "CC",
    "name": "Cocos (Keeling) Islands"
},
{
    "id": "CD",
    "name": "Congo, the Democratic Republic of the",
    "nationalBans":["*"],
    "tooltip":"All airports in Congo are closed."
},
{
    "id": "CF",
    "name": "Central African Republic"
},
{
    "id": "CG",
    "name": "Congo",
    "nationalBans":["*"],
    "tooltip":"All airports in Congo are closed."
},
{
    "id": "CH",
    "name": "Switzerland",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Switzerland.\n- This does not apply if arriving from Belgium, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Iceland, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia or Sweden.\n- This does not apply to nationals or residents of Switzerland.\n- This does not apply to passenger with a cross-border commuter permit, a visa issued by Switzerland for the purpose of \"business meetings\" as specialists in the field of health or \"official visit\" of great importance, or who have an assurance of a residence permit.\n- This does not apply to passengers who are entitled to freedom of movement and have a professional reason for entering Switzerland and have a confirmation of registration.\n- This does not apply to passengers who are of great importance as specialists in the health sector."
},
{
    "id": "CI",
    "name": "Cote d'Ivoire",
    "nationalBans":["*"],
    "tooltip":"Cote d'Ivoire borders are closed."
},
{
    "id": "CK",
    "name": "Cook Islands",
    "bans": {"*":-14},
    "tooltip": "Passengers who have transited or been in any country except for Cook Isl. and New Zealand in the past 14 days are not allowed to enter Cook Isl."
},
{
    "id": "CL",
    "name": "Chile",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Chile.\nThis does not apply to:\n- Nationals of Chile;\n- Residents of Chile;\n- Passengers bringing humanitarian help;\n- Passengers with a diplomatic visa and an official ID issued by the Ministry of Foreign Affairs of Chile;\n- Passengers with a safe-conduct.\n2. Nationals and residents of Chile will be quarantined for 14 days.\n3. Nationals of New Zealand are not allowed to transit Chile.\n- This does not apply if the passenger resides in Chile."
},
{
    "id": "CM",
    "name": "Cameroon"
},
{
    "id": "CN",
    "name": "China",
    "nationalBans":["*"],
    "tooltip":"1. Effective 00:00 local time 28 March 2020, passengers are not allowed to transit or enter China (People's Rep.).\n- This does not apply to nationals of China (People's Rep.).\n- This does not apply to passengers with a Hong Kong (SAR China) passport or a Macao (SAR China) passport. \n- This does not apply to passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport.\n- This does not apply to passengers with a diplomatic, service, courtesy or C visa.\n- This does not apply to passengers with a visa issued after 28 March 2020.\n\n2. All passengers arriving at PEK will have a PCR test and be quarantined at the designated location in Beijing for 14 days. \n3. Passengers who live in or have been in Australia, Austria, Belgium, Canada, Czechia, Denmark, Finland, France, Germany, Greece, Iran, Italy, Korea (Rep.), Malaysia, Netherlands, Norway, Qatar, Saudi Arabia, Spain , Sweden, Switzerland, United Kingdom or USA in the past 14 days arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo 14-day quarantine at home or in designated places for medical observation.\n4. Passengers who have not been in Australia, Austria, Belgium, Canada, Czechia, Denmark, Finland, France, Germany, Greece, Iran, Italy, Korea (Rep.), Malaysia, Netherlands, Norway, Qatar, Saudi Arabia, Spain , Sweden, Switzerland, United Kingdom or USA in the past 14 days arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo a Nucleic Acid Testing. \n5. Passengers who live in or have been in France, Germany, Iran, Italy, Japan, Korea (Rep.), Spain or USA in the past 14 days arriving at Guangzhou (CAN) or Shenzhen (SZX) must undergo 14-day quarantine at home or in designated places for medical observation. All passengers arriving at SZX will have a PCR test.\n6. All passengers arriving at XMN will be quarantined for medical observation at the designated hotels for 14 days on their own expenses.\n- This does not apply to passengers under 18 years old, passengers above 70 years old, pregnant women and passengers suffering from illness. They must apply for permission to undergo a 14-day quarantine at home."
},
{
    "id": "CO",
    "name": "Colombia",
    "nationalBans":["*"],
    "tooltip":"1.      Passengers are not allowed to enter Colombia.\n\n2.      This does not apply to nationals of Colombia and passengers who reside in Colombia. They will be required to self-isolate for 14 days.\n\n3.      This does not apply to passengers who are in a diplomatic mission. They will be required to self-isolate for 14 days."
},
{
    "id": "CR",
    "name": "Costa Rica",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Costa Rica.\n- This does not apply to nationals of Costa Rica.\n- This does not apply to passengers who reside in Costa Rica.\n2. Nationals and residents of Costa Rica will be required to be in isolation for a period of 14 days."
},
{
    "id": "CU",
    "name": "Cuba"
},
{
    "id": "CV",
    "name": "Cabo Verde"
},
{
    "id": "CW",
    "name": "Curaçao",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Curacao until 12 April 2020.\nThis does not apply to:\n- Residents of Curacao; \n- Airline crew;\n- Medical specialist and other medical personnel if authorized by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao;\n- Persons deemed necessary or specifically approved by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao."
},
{
    "id": "CX",
    "name": "Christmas Island"
},
{
    "id": "CY",
    "name": "Cyprus",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Cyprus.\n- This does not apply to nationals of Cyprus and passengers who reside in Cyprus.\n- This does not apply to passengers who are in a diplomatic mission.\n- This does not apply to passengers with a special authorization issued by the competent ministry of Cyprus.\n- This does not apply to passengers attending educational institutions in Cyprus.\n2. Nationals and residents of Cyprus must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days. \n3. Passengers who are in a diplomatic mission must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days.\n4. Passengers who have a special authorization issued by the competent ministry of Cyprus or are attending educational institutions in Cyprus, must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days."
},
{
    "id": "CZ",
    "name": "Czech Republic",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Czechia.\n\n- This does not apply to nationals of Czechia.\n\n- This does not apply to passengers with a Czech residence permit for stay over 90 days or for permanent stay.\n\n- This does not apply to passengers with a Czech long-stay visa (not including visa stickers with a national comment D/VR/XX).\n\n- This does not apply to passengers with the European Health Insurance Card issued by Czechia."
},
{
    "id": "DE",
    "name": "Germany",
    "nationalRestrictions":["*"],
    "tooltip":"Passengers must present a completed Public Health Passenger Locator Form upon arrival."
},
{
    "id": "DJ",
    "name": "Djibouti",
    "nationalBans":["*"],
    "tooltip":"Flights to Djibouti are suspended."
},
{
    "id": "DK",
    "name": "Denmark",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"All passengers are not allowed to enter Denmark.\n\n- This does not apply to nationals of Denmark.\n\n- This does not apply to residents of Denmark.\n\n- This does not apply to passengers with one of the following purposes:\n\na. Visiting a critically or terminal ill family member;\n\nb. Participating in a funeral;\n\nc. Called for a court case;\n\nd. Exercising visitation rights with a minor;\n\ne. Being a legal guardian for a minor;\n\nf. Already in an ongoing health treatment;\n\ng. Have employment in Denmark – documentation needed;\n\nh. Passengers in transit or with connecting flights, and who can provide/present valid ticket for next destination which must be non-domestic;\n\ni. Passengers who can provide documentation for having their vehicle parked at Copenhagen Airport, and who need the vehicle for their ongoing journey out of Denmark (e.g. to Sweden)."
},
{
    "id": "DM",
    "name": "Dominica",
    "nationalBans":["*"],
    "tooltip":"1. Flights to Dominica are suspended.\n2. Nationals of Dominica will be placed in a 14-day mandatory quarantine."
},
{
    "id": "DO",
    "name": "Dominican Republic",
    "nationalBans":["*"],
    "tooltip":"Flights to Dominican Rep. are suspended until 3 April 2020."
},
{
    "id": "DZ",
    "name": "Algeria"
},
{
    "id": "EC",
    "name": "Ecuador",
    "nationalRestrictions":["*"],
    "tooltip":"Passengers are required to self-isolate for a period of 14 days."
},
{
    "id": "EE",
    "name": "Estonia",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Estonia.\n- This does not apply to nationals and residents of Estonia.\n- This does not apply to passengers who are entering Estonia in order to go back home with a transport other than the plane. They must not show any symptoms of Coronavirus (COVID-19).\n- This does not apply to nationals and residents of Latvia who work in Estonia. They must not show any symptoms of Coronavirus (COVID-19).\n- This does not apply to the following:\npassengers who are asymptomatic and who are directly involved in transporting goods and raw materials, including the loading of goods;\npersons related to the international transport of goods and passengers, members of the team or crew servicing the international means of transport, and the persons performing repair, warranty or maintenance operations on the means of transport;\npassengers related to the business continuity of critical services;\npassengers whose arrival in Estonia is related to the maintenance, repair or warranty activities of a device, or operations related to information and communication technology, if these are necessary for ensuring the operation of a company."
},
{
    "id": "EG",
    "name": "Egypt",
    "nationalBans":["*"],
    "tooltip": "Flights to Egypt are suspended.\n- This does not apply to humanitarian, repatriation and United Nations flights with a pre-authorization from the Egyptian Civil Aviation Authority."
},
{
    "id": "EH",
    "name": "Western Sahara"
},
{
    "id": "ER",
    "name": "Eritrea"
},
{
    "id": "ES",
    "name": "Spain",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Spain.\n\n-This does not apply to:\n\na) Nationals and residents of a European Union or Schengen member state, who go directly to their place of residence;\n\nb) Holders of a long-term visa issued by a European Union or Schengen member state who travel to the country that issued the visa;\n\nc) Cross-border workers;\n\nd) Healthcare or elderly care professionals in the performance of their duties;\n\ne) Transport of goods personnel;\n\nf) Diplomats, international organizations, military personnel and members of humanitarian organizations in the performance of their duties;\n\ng) People traveling for imperative family reasons duly accredited.\n\nh) Persons who document documentary reasons of force majeure or situation of need, or whose entry is permitted for humanitarian reasons."
},
{
    "id": "ET",
    "name": "Ethiopia",
    "nationalRestrictions":["*"],
    "tooltip":"Effective 23 March 2020, all passengers arriving in Ethiopia will be placed in a mandatory quarantine at the Ethiopian Skylight Hotel for 14 days at their own expense."
},
{
    "id": "FI",
    "name": "Finland",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Finland.\n- This does not apply to nationals of Finland. \n- This does not apply to family members of nationals of Finland. \n- This does not apply to passengers with a residence permit issued by Finland. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland residing in Finland, and their family members. \nThis does not apply to passengers with a British passport residing in Finland, and their family members. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland and their family members who are returning via Finland to their respective country of residence. \n- This does not apply to passengers with a British passport and their family members who are returning via Finland to their respective country of residence. \nThis does not apply to residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom who are returning via Finland to their respective country of residence. \n- This does not apply to the following passengers:\na. Healthcare and rescue service professionals/personnel, health researchers, and elderly care professionals;\nb. Transport personnel and other transport staff to the extent necessary;\nc. Workers, who based on permanent employee relationship work daily in another country and returns back to the country of residence at least once a week, taking into consideration local circumstances and natural travel-to-work area;\nd. Diplomats, staff of international organisations, military personnel and humanitarian aid workers in the exercise of their functions;\ne. Necessary (return) transit and returns;\nf. Passengers travelling for imperative family reasons;\ng. Persons in need of international protection or for other humanitarian reasons;\nh. Other necessary and justified traffic. For example, other necessary traffic would be maintenance work, that requires maintenance team or a person arriving from another country and this work cannot be postponed. \n2. Nationals and residents of Finland will be required to self-quarantine for 14 days."
},
{
    "id": "FJ",
    "name": "Fiji",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip": "1. Passengers and airline crew are not allowed to enter Fiji. \n- This does not apply to nationals of Fiji.\n2. Nationals of Fiji must go into quarantine for a period of 14 days."
},
{
    "id": "FK",
    "name": "Falkland Islands",
    "nationalRestrictions":["*"],
    "tooltip":"1. Passengers are subject to isolation for a period of 14 days if they develop symptoms of Coronavirus (COVID-19). They must contact the local hospital on 28000 for advice.\n2. Passengers who arrive from or have been in Wuhan City or Hubei Province of China (People's Rep.), Iran, Italy, Daegu or Cheongdo of Korea (Rep.), in the past 14 days, and are not a Falkland Islands resident, should not travel to the Falkland Islands. All such arrivals, including local residents, will be interviewed and medically examined on arrival. They will be required to self-isolate for 14 days."
},
{
    "id": "FM",
    "name": "Micronesia, Federated States of",
    "nationalBans":["*"],
    "tooltip":"1. Passengers traveling to the state of Chuuk must be self-quarantined for 14 days in COVID-19 free country before departure.\n2. Passengers and airline crew must go thorough medical screening upon arrival. \n3. Passengers are not allowed to enter the state of Pohnpei.\n- This does not apply to residents of Pohnpei.\n- This does not apply to medical and technical personnel.\n4. Passengers traveling to the state of Pohnpei must have a medical certificate and must be quarantined for 14 days.\nEffective 29 March 2020:\nPassengers traveling to the state of Chuuk will be quarantined for 14 days."
},
{
    "id": "FO",
    "name": "Faroe Islands"
},
{
    "id": "FR",
    "name": "France",
    "nationalBans":["*"],
    "tooltip":"Passengers arriving from a non-Schengen Member State are not allowed to enter France.\nThis does not apply to:\n- nationals of EEA Member States, Switzerland and passengers with a British passport with nationality \"British Citizen\", \"British Overseas Territories Citizen\" issued by Gibraltar, British Passports with a Certificate of Entitlement to the Right of Abode issued by the United Kingdom; \n- passengers with residence permit issued by France;\n- passengers with a residence permit issued by an EEA Member States, Switzerland or the United Kingdom on their way home; \n- healthcare professionals, health researchers related to Coronavirus (Covid-19)."
},
{
    "id": "GA",
    "name": "Gabon",
    "bans":{"SCH":-14, "CN":-14, "KR":-14, "US":-14, "GB":-14},
    "nationalRestrictions":["*"],
    "tooltip":"Passengers who have been in Austria, Belgium, Bulgaria, China (People’s Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Italy, Ireland (Rep.), Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Spain, Slovakia, Slovenia, Sweden, Switzerland, USA or the United Kingdom in the last 14 days are not allowed to enter Gabon.\n\n- This does not apply to nationals and residents of Gabon."
},
{
    "id": "GB",
    "name": "United Kingdom of Great Britain and Northern Ireland"
},
{
    "id": "GD",
    "name": "Grenada",
    "nationalBans":["CN"],
    "bans":{"SCH":-14, "UK":-14, "CN":-14, "KR":-14, "IE":-14, "IR":-14},
    "nationalsExcempt":true,
    "tooltip":"1. Passengers who have been in Austria, Belgium, Bulgaria, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom in the past 14 days are not allowed to enter Grenada. \n- This does not apply to nationals of Grenada.\n- This does not apply to residents of Grenada.\n2. Nationals of China (People's Rep.) are not allowed to enter Grenada. \n3. Nationals and residents of Grenada who have been in Austria, Belgium, Bulgaria, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom in the past 14 days will be put in quarantine upon arrival for a period of 14 days."
},
{
    "id": "GE",
    "name": "Georgia",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Georgia.\n- This does not apply to nationals and residents of Georgia.\n- This does not apply to airline crew.\n- This does not apply to representatives of diplomatic missions and international organizations and their family members accredited to Georgia.\n- This does not apply to mixed families where one of the spouses or their under age child is a citizen of Georgia.\n- This does not apply to passengers who are part of the humanitarian mission if trip of such mission (doctors, volunteers) becomes a necessity. \n- This does not apply to passengers who have been granted the status of stateless persons by respective authorities of Georgia.\n- This does not apply to passengers who are holding status neutral travel documents.\n- This does not apply to passengers with a refugee status in Georgia.\n2. Passengers with a residence permit issued by Georgia must get an OKTOBOARD before departing for Georgia."
},
{
    "id": "GF",
    "name": "French Guiana"
},
{
    "id": "GG",
    "name": "Guernsey"
},
{
    "id": "GH",
    "name": "Ghana",
    "bans":{"*":-14},
    "tooltip":"1. Passengers who have been in countries with more than 200 confirmed cases of coronavirus (COVID-19) in the past 14 days are not allowed to enter Ghana.\n- This does not apply to nationals and residents of Ghana.\n2. Nationals and residents of Ghana will be subjected to self-quarantine.\n3. Any admissible passenger, who exhibits symptoms of Covid-19 will be quarantined and tested."
},
{
    "id": "GI",
    "name": "Gibraltar"
},
{
    "id": "GL",
    "name": "Greenland"
},
{
    "id": "GM",
    "name": "Gambia"
},
{
    "id": "GN",
    "name": "Guinea"
},
{
    "id": "GP",
    "name": "Guadeloupe"
},
{
    "id": "GQ",
    "name": "Equatorial Guinea"
},
{
    "id": "GR",
    "name": "Greece",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Greece.\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland.\n- This does not apply to family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland.\n- This does not apply to passengers with a British passport and their family members.\n- This does not apply to passengers with a residence permit issued by Greece. A certificate of application for renewal of a residence permit issued by Greece is not accepted.\n- This does not apply to passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.\n- This does not apply to passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.\n- This does not apply to the following passengers:\na. Healthcare professionals and health researchers designated to support the national health care system.\nb. government members, diplomats, staff of international organizations, military personnel and humanitarian aid workers in the exercise of their duties.\nc. passengers in transit.\nd. Aircraft flight crew.\ne. passengers travelling for imperative family or business reasons provided that the relevant authorization has been obtained by the Greek embassy/consulate.\n2. Passengers are required to be in isolation for a period of 14 days.\n- This does not apply to airline crew."
},
{
    "id": "GS",
    "name": "South Georgia and the South Sandwich Islands"
},
{
    "id": "GT",
    "name": "Guatemala",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"1. Passengers and airline crew who have transited or have been in China (People's Rep.), France, Germany, Iran, Italy, Korea (Rep.) or Spain in the past 30 days are not allowed to enter Guatemala.\n\n- This does not apply to nationals of Guatemala.\n\n- This does not apply to passengers who reside in Guatemala.\n\n2. Nationals and residents of Guatemala arriving from China (People's Rep.), France, Germany, Iran, Italy, Korea (Rep.) or Spain must be in home quarantine for 7 days."
},
{
    "id": "GU",
    "name": "Guam",
    "nationalRestrictions":["*"],
    "tooltip":"Passengers will be quarantined for a period of 14 days upon arrival. \n- This does not apply to passengers with a healthcare recognized and certified document which confirms that they are not infected with COVID-19 within\nthe last 72 hours."
},
{
    "id": "GW",
    "name": "Guinea-Bissau"
},
{
    "id": "GY",
    "name": "Guyana"
},
{
    "id": "HK",
    "name": "Hong Kong",
    "nationalsExcempt":true,
    "nationalBans":["CN"],
    "bans":{"CN":-14, "IR":-14, "IT":-14, "KR":-14, "FR":-14},
    "nationalRestrictions":["*"],
    "tooltip":"1. Nationals of China (People's Rep.) with a passport issued in Hubei Province (China People's Rep.) are not allowed to enter Hong Kong (SAR China). \n2. Passengers who reside or have been in the Hubei Province (China People's Rep.) in the past 14 days are not allowed to enter Hong Kong (SAR China). \n- This does not apply to passengers with a Hong Kong (SAR China) passport. \n- This does not apply to passengers who reside in Hong Kong (SAR China). \n3. Passengers who have been in China (People's Rep.), Iran or the Emilia-Romagna, Lombardy and Veneto regions (covering Bologna, Milan, Venice and Verona) in Italy in the past 14 days, are not allowed to enter if their permitted stay in Hong Kong (SAR China) is less than 14 days. \n- This does not apply to passengers with a Hong Kong (SAR China) passport. \n4. Passengers who reside or have been in the Korea (Rep.) in the past 14 days are not allowed to enter Hong Kong (SAR China). \n- This does not apply to passengers with a Hong Kong (SAR China) passport. - This does not apply to passengers who reside in Hong Kong (SAR China). \n5. All passengers who have been outside Hong Kong (SAR China) in the past 14 days are subject to a compulsory quarantine for 14 days. \n- This does not apply to airline crew.\n- This does not apply when passengers have only been in Chinese Taipei or Macao (SAR China) in the past 14 days.\n6. All arriving passengers and crew members must present a completed Health Declaration Form to the Department of Health upon arrival."
},
{
    "id": "HM",
    "name": "Heard Island and McDonald Islands"
},
{
    "id": "HN",
    "name": "Honduras",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Honduras. \n- This does not apply to nationals and residents of Honduras. \n- This does not apply to members of the diplomatic corps. \n2. Nationals and residents of Honduras can only land at San Pedro Sula (SAP) or Tegucigalpa (TGU). \n3. Passengers who are members of the diplomatic corps can only land at San Pedro Sula (SAP) or Tegucigalpa (TGU). \n4. Nationals and residents of Honduras are required to self-isolate for 14 days. \n5. Passengers who are members of the diplomatic corps are required to self-isolate for 14 days."
},
{
    "id": "HR",
    "name": "Croatia",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Passengers are prohibited from crossing the borders of Croatia until 18 April 2020.\n- This does not apply to nationals of Croatia and their family members and to those going to a country where they work and live.\n- This does not apply to nationals of the EU, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members.\n- This does not apply to passengers with a long-term resident permit or a long-term visa issued by a Schengen Member State and the persons deriving their right to reside from other EU Directives or national law or who hold national long-term visas.\n- This does not apply to healthcare professionals, healthcare researchers and collaborators, experts in care for the elderly, and persons requiring urgent medical treatment. \n- This does not apply to cross-border workers.\n- This does not apply to diplomats, police officers in the performance of their activities, Civil Defence services and teams, international organizations staff and International military personnel in carrying out their functions.\n- This does not apply to passengers in transit (including passengers in transit by air transport)."
},
{
    "id": "HT",
    "name": "Haiti",
    "bans":{"CN":-14, "FR":-14, "DE":-14, "IR":-14, "IT":-14, "KR":-14},
    "tooltip":"Passengers who have been in China (People's Rep.), France, Germany, Iran, Italy or Korea (Rep.) in the past 14 days, are not allowed to enter Haiti."
},
{
    "id": "HU",
    "name": "Hungary",
    "nationalBans":["*"],
    "tooltip":"Hungary's borders are closed.\n- This does not apply to nationals of Hungary and EEA nationals with a residence permit issued by Hungary."
},
{
    "id": "ID",
    "name": "Indonesia",
    "nationalRestrictions":["*"],
    "bans":{"FR":-14, "DE":-14, "IR":-14, "IT":-14, "ES":-14, "CH":-14, "GB":-14, "CN":-14, "KR":-14},
    "nationalsExcempt":true,
    "tooltip":"1. All visa exemptions and visa on arrival to foreign passengers are suspended till 20 April 2020.\n2. Passengers and airline crew who have been in France, Germany, Iran, Italy, Spain, Switzerland, United Kingdom or Vatican City (Holy See) in the past 14 days are not allowed to enter or transit through Indonesia. \n- This does not apply to nationals of Indonesia. \n3. Passengers with a Permanent Staying Permit (KITAP) or a Temporary Staying Permit (KITAS) are only allowed to enter Indonesia if they have a valid health certification issued by local health authorities in English stating they are fit for travel and free from respiratory disease. The certification must have been issued at latest 7 days prior to departure.\n4. Passengers and airline crew who have been in China (People's Rep.) or Daegu and Gyeongsangbuk-do Province in Korea (Rep.) in the past 14 days are not allowed to enter or transit Indonesia. \n- This does not apply to nationals of Indonesia. \n- This does not apply to residents of Indonesia. \n- This does not apply to the following passengers:\na. passengers with a visa issued by Indonesian Embassy; or \nb. passengers with an Indonesian Permanent Residence Card; or \nc. passengers with APEC Business Travel Card (ABTC) coming from China (People's Rep.) if they can show valid Certificate of Health free from Covid-19 from their local health authorities. Health certificate must be in English; or \nd. passengers with Diplomatic Residence Permit and Official Residence Permit from China (People's Rep.), Italy, Iran and Korea (Rep.) if they can show valid Certificate of Health free from Covid-19 from their local health authorities. The health certificate must be in English; or \ne. passengers with expired Diplomatic Residence Permit and Official Residence Permit from China (People's Rep.), Italy, Iran and Korea (Rep.) if they can show valid Diplomat ID card or valid Identity card as employee of Foreign Representative working in Indonesia which issue by Indonesian Ministry of Foreign Affairs. They must also have valid Certificate of Health free from Covid-19 from their local health authorities. The health certificate must be in English.\n5. Passengers who in the past 14 days have been in areas within Iran, Italy or Korea (Rep.) other than the following mentioned areas must provide a valid health certificate. The certificate must be in English and have been issued at latest 7 days prior to departure from local health authority. It should contain information of (1) fit for travel and (2) free from respiratory disease. - Tehran, Qom or Gilan in Iran; - Lombardi, Veneto, Emilia Romagna, Marche or Piedmont in Italy; - Daegu or Gyeongsangbuk-do Province in Korea (Rep.). This does not apply to nationals of Indonesia. \n6. Passengers arriving from Iran, Italy or Korea (Rep.) are required to complete a Health Alert Card (Kartu Kewaspadaan Kesehatan) issued by the Ministry of Health of the Republic of Indonesia prior to arrival."
},
{
    "id": "IE",
    "name": "Ireland"
},
{
    "id": "IL",
    "name": "Israel",
    "nationalRestrictions":["*"],
    "bans":{"CN":-14, "EG":-14, "HK":-14, "IT":-14, "JP":-14, "KR":-14, "MO":-14, "SG":-14, "TH":-14},
    "nationalsExcempt":true,
    "tooltip":"1. Passengers are required to be in home quarantine for 14 days from their date of entry. They must have an approval letter for arriving to the state of Israel, signed by the Deputy Director General of the Consular Affairs Division of the Israeli Ministry of Foreign Affairs or by the Population and Immigration Authority and Border Control.\n\n- This does not apply to nationals of Israel.\n\n- This does not apply to residents of Israel.\n\n- This does not apply to crew members who adhere to special procedures published by Israeli Airports Authority.\n\n- This does not apply to accredited Diplomats with a Diplomatic/Official I.D Card issued by the Israeli Ministry of Foreign affairs, stating their Diplomatic or official Status in Israel.\n\n2. Passengers who have been in China (People's Rep.), Egypt, Hong Kong (SAR China), Italy, Japan, Korea (Rep.), Macao (SAR China), Singapore or Thailand in the past 14 days are not allowed to enter Israel.\n\n- This does not apply to nationals of Israel.\n\n- This does not apply to residents of Israel.\n\n- This does not apply to accredited Diplomats with a Diplomatic/Official I.D Card issued by the Israeli Ministry of Foreign affairs, stating their Diplomatic or official Status in Israel.\n\n- This does not apply to passengers with an approval letter signed by the Deputy Director General of the Consular Affairs Division of the Israeli Ministry of Foreign Affairs or by the Population and Immigration Authority and Border Control."
},
{
    "id": "IM",
    "name": "Isle of Man"
},
{
    "id": "IN",
    "name": "India",
    "nationalBans":["*"],
    "tooltip":"Flights to India are suspended from 00:01 GMT 22 March 2020 until 00:01 GMT 29 March 2020."
},
{
    "id": "IO",
    "name": "British Indian Ocean Territory"
},
{
    "id": "IQ",
    "name": "Iraq",
    "nationalBans":["CN", "IR"],
    "nationalRestrictions":["KW", "BH"],
    "restrictions":{"*":-30},
    "bans":{"CN":-14, "HK":-14, "IR":-14, "IT":-14, "JP":-14, "KR":-14, "MO":-14, "SG":-14, "TH":-14},
    "tooltip":"1.Baghdad (BGW) closed operations from 17 March 2020, 23:00 local time, until 24 March 2020, 23:00 local time.\n2.Nationals of China (People's Rep.) are not allowed to enter.\n3.Nationals of Iran are not allowed to enter. \n-This does not apply at Erbil (EBL) and Sulaymaniyah (ISU).\n4.Passengers who have been in China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Japan, Korea (Rep.), Macao (SAR China), Singapore or Thailand in the past 14 days are not allowed to enter Iraq.\n-This does not apply at Erbil (EBL) and Sulaymaniyah (ISU).\n-This does not apply to nationals and residents of Iraq who will be quarantined for 14 days.\n5. Nationals of Iraq who have been in China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Japan, Korea (Rep.), Macao (SAR China), Singapore or Thailand in the past 14 days will be quarantined for 14 days.\n- This does not apply at Erbil (EBL) and Sulaymaniyah (ISU).\n6.Nationals of Bahrain, France, Germany, Iran, Italy, Japan, Korea Rep., Kuwait, Qatar, Singapore, Spain and Thailand are not allowed to enter via Baghdad (BGW), Basra (BSR) and Najaf (NJF).\n7.Passengers who have been in Bahrain, China (People's Rep.), France, Germany, Iran, Italy, Japan, Korea Rep., Kuwait, Qatar, Singapore, Spain and Thailand in the past 14 days are not allowed to enter via Baghdad (BGW), Basra (BSR) and Najaf (NJF)\n8. Nationals of Iran with a normal passport are not allowed to enter via Erbil (EBL) and Sulaymaniyah (ISU).\n9.Nationals of Bahrain and Kuwait with a normal passport are not allowed to enter via Erbil (EBL) and Sulaymaniyah (ISU).\n10.Passengers who have been in Iran on or after 1 January 2020 are not allowed to enter via Erbil (EBL) and Sulaymaniyah (ISU).\n11.Passengers who have been in Bahrain, China (People's Rep.), France, Hong Kong (SAR China), Italy, Japan, Korea Rep., Kuwait, Macao (SAR China), Singapore, Spain or Thailand, in the last 30 days are not allowed to enter via Erbil (EBL) and Sulaymaniyah (ISU).\n12.Passengers who have been in Albania, Austria, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czechia, Finland, France, Germany, Greece, Hungary, Ireland Rep., Lebanon, Lithuania, Luxembourg, Malta, Montenegro, Netherlands, Norway, Poland, Portugal, Romania, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom in the last 30 days, when arriving at Erbil (EBL) and Sulaymaniyah (ISU) will be quarantined.\n13.Nationals of Iraq who on or after 1 January 2020 have been in Bahrain, China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Japan, Korea Rep., Kuwait, Macao (SAR China), Singapore, or Thailand, when arriving at Erbil (EBL) and Sulaymaniyah (ISU) will be quarantined."
},
{
    "id": "IR",
    "name": "Iran, Islamic Republic of",
    "nationalRestrictions":["CN", "HK", "MO"],
    "nationalBans":["AE"],
    "tooltip":"1. Nationals of China (People's Rep.) with a normal passport, passengers with a Hong Kong (SAR China) passport and passengers with a Macao (SAR China) passport are no longer visa exempt. However, they can obtain a visa on arrival.\n\nThey are required to clear the medical and health check upon arrival. After that they will be given a certificate.\n\n2. Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Iran."
},
{
    "id": "IS",
    "name": "Iceland",
    "nationalBans":["*"],
    "tooltip":"1.Passengers are not allowed to enter Iceland until 17 April 2020. \nThis does not apply to nationals of EEA Member States and Switzerland.\nThis does not apply to passengers with a British passport. \nThis does not apply to passengers with a residence permit issued by a Schengen Member State.\nThis does not apply to:\n- family members of nationals of EEA Member States, Switzerland and of British nationals;\n- diplomats;\n- health and care workers traveling on duty;\n- humanitarian aid workers;\n- international organizations personnel;\n- passengers that require international protection; \n- passengers traveling on family emergencies;\n- members of armed forces traveling on duty. \n2.Passengers listed in above exemptions who intent to travel through Iceland on their way to another Schengen Member State must have a written confirmation of their permission to enter the other Schengen Member State.\n3.Returning nationals and residents of Iceland must undergo quarantine for 14 days."
},
{
    "id": "IT",
    "name": "Italy",
    "nationalBans":["*"],
    "tooltip":"1.Passengers traveling as tourists are not allowed to enter via airports in below listed areas. \n2.Passengers arriving at airports in below listed areas, are allowed to enter if they are traveling on business, for health reasons, in an emergency or if they reside in one of these areas. A completed \"Self-declaration\" form must be presented upon arrival. \n- Areas: Lombardy region and the provinces of Alessandria, Asti, Modena, Novara, Padova, Parma, Pesaro and Urbino, Piacenza, Reggio Emilia, Rimini, Treviso-Venice, Verbano - Cusio - Ossola and Vercelli. \n3. Passengers must report to the regional Health Office upon arrival in Italy and be quarantined for 14 days.\n- This does not apply to passengers traveling on urgent working purposes with a written declaration. They are allowed to enter for 72 hours with a possible extension of 24 hours."
},
{
    "id": "JE",
    "name": "Jersey"
},
{
    "id": "JM",
    "name": "Jamaica",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Jamaica.\n- This does not apply to passengers with an authorization issued by the government of Jamaica.\n2. Passengers with an authorization issued by the government of Jamaica will be quarantined for 14 days."
},
{
    "id": "JO",
    "name": "Jordan",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Jordan."
},
{
    "id": "JP",
    "name": "Japan",
    "bans":{"CN":-14, "KR":-14, "IR":-14, "IT":-14, "IS":-14, "ES":-14, "CH":-14},
    "nationalBans":["CN"],
    "nationalRestrictions":["*"],
    "nationalsExcempt":true,
    "tooltip": "1. Visas issued on or before 27 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand and Viet Nam are invalidated. \n2. Visa exemption for nationals of Brunei Darussalam, Indonesia, Israel, Malaysia, Singapore and Thailand is suspended.\n3. Visa exemption for nationals Viet Nam, Qatar with a diplomatic or an official passport is suspended.\n4. Visa exemption granted to passengers with an APEC Business Travel Card issued by Brunei Darussalam, China (People's Rep.), Hong Kong (SAR China), Indonesia, Korea (Rep.), Malaysia, Philippines, Singapore, Thailand or Viet Nam, is suspended.\n5. Passengers who have been in the Hubei Province or Zhejiang Province (China People's Rep.) in the past 14 days are not allowed to enter Japan. \n- This does not apply to nationals of Japan; \n- This does not apply to spouses or children of nationals of Japan if they can prove it. \n6. Passengers who have been in Cheongdo County or Daegu City in Korea (Rep.) in the past 14 days are not allowed to enter Japan. \n- This does not apply to nationals of Japan; \n- This does not apply to spouses or children of nationals of Japan if they can prove it. \n7. Passengers who have been in Gyeongsan-si, Andong-si , Yeongcheon-si, Chilgok-gun, Uiseong-gun, Seongju-gun or Gunwi-gun in Gyeongsangbuk-do in Korea (Rep.) in the past 14 days are not allowed to enter Japan. \n-This does not apply to nationals of Japan. \n-This does not apply to spouses or children of nationals of Japan if they can prove it. \n8. Passengers who have been in Andorra, Austria, Belgium, Denmark, Estonia, France, Germany, Iceland, Iran, Ireland (Rep.), Italy, Liechtenstein, Luxembourg, Malta, Monaco, Netherlands, Norway, Portugal, San Marino, Slovenia, Spain, Sweden, Switzerland or Vatican City (Holy See) in the past 14 days are not allowed to enter Japan.\n- This does not apply to nationals of Japan. \n- This does not apply to spouses or children of nationals of Japan if they can prove it. \n9. Nationals of China (People's Rep.) with a passport issued in Hubei Province or Zhejiang Province (China People's Rep.) are not allowed to enter Japan. \n- This does not apply when passengers can prove that they have not been in Hubei Province and Zhejiang Province the last 14 days. \n10. Passengers who were in the cruise ship 'Westerdam' are not allowed to enter Japan. - This does not apply to nationals of Japan. \n11. Visas issued on or before 8 March 2020 by the Embassies, Consulates-General and Consulate of Japan in China (People's Rep.), Hong Kong (SAR China) or Korea (Rep.) are invalidated. \n12. Visa exemptions for passengers with a British National (Overseas) passport, passengers with a Hong Kong (SAR China) passport, passengers with a Macao (SAR China) passport and nationals of Korea (Rep.) have been suspended till 30 April 2020. \n13. Visas issued on or before 20 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) are invalidated. \n14. Nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See) and passengers with a British passport are no longer visa exempt to Japan until 30 April 2020.\n15. Passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom, Vatican City (Holy See) are requested to stay at the location designated by a quarantine station chief for 14 days and to not use public transportation in Japan.\n16. Passengers arriving from Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand, USA or Viet Nam are requested to stay at the location designated by a quarantine station chief for 14 days and to not use public transportation in Japan."
},
{
    "id": "KE",
    "name": "Kenya",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Kenya.\n- This does not apply to nationals and residents of Kenya."
},
{
    "id": "KG",
    "name": "Kyrgyzstan",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"Flights to Kyrgyzstan are suspended."
},
{
    "id": "KH",
    "name": "Cambodia",
    "bans":{"FR":-1, "DE":-1, "IR":-1, "IT":-1, "ES":-1, "US":-1},
    "tooltip":"1. Passengers arriving from France, Germany, Iran, Italy, Spain or USA are not allowed to enter Cambodia.\n- This does not apply to nationals and residents of Cambodia. \n2. Nationals and residents of Cambodia who have been in France, Germany, Iran, Italy, Spain or USA in the past 14 days will be quarantined for 14 days."
},
{
    "id": "KI",
    "name": "Kiribati",
    "bans":{"AU":-14, "CN":-14, "EG":-14, "FR":-14, "DE":-14, "IT":-14, "JP":-14, "KR":-14, "MY":-14, "SG":-14, "ES":-14, "TH":-14, "US":-14, "AE":-14, "GB":-14, "VN":-14},
    "tooltip":"1. Passengers who have been in Australia, China (People's Rep.), Egypt, France, Germany, Italy, Japan, Korea (Rep.), Malaysia, Singapore, Spain, Thailand, USA, United Arab Emirates, United Kingdom or Viet Nam are not allowed to enter Kiribati. They must have stayed in a country with no confirmed cases of Coronavirus (COVID-19) for a period of minimum 14 days before entering Kiribati. They must provide a medical clearance to confirm that they are free from the Coronavirus (COVID-19).\n\n2. Passengers must fill-in a \"Health Arrival Form\" and e-tickets must be provided to the immigration at time of arrival."
},
{
    "id": "KM",
    "name": "Comoros",
    "restrictions":{"CN":-1000, "EG":-1000, "FR":-1000, "IT":-1000, "MO":-1000, "SA":-1000, "ES":-1000, "TU":-1000},
    "tooltip": "Passengers who have transited or have been in China (People's Rep.), Egypt, France, Iran, Italy, Morocco, South Africa, Spain or Tunisia are not allowed to enter Comoros."
},
{
    "id": "KN",
    "name": "Saint Kitts and Nevis",
    "nationalBans":["*"],
    "tooltip":"Flights to St. Kitts and Nevis are suspended until 7 April 2020."
},
{
    "id": "KP",
    "name": "North Korea",
    "nationalBans":["*"],
    "tooltip":"1. Passengers traveling as tourists are not allowed to enter. \n2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival."
},
{
    "id": "KR",
    "name": "South Korea",
    "bans":{"CN":-14},
    "nationalBans":["CN"],
    "nationalRestrictions":["*"],
    "tooltip":"1. Visitors who have been in the Hubei Province (China People's Rep.) in the past 14 days are not allowed to transit or enter Korea (Rep.). \n2. Nationals of China (People's Rep) with a passport issued in the Hubei Province are not allowed to enter Korea (Rep.). \n3. Korean visas issued by the Wuhan Consulate in the Hubei Province are invalidated. \n4. A visa is required to transit through Korea (Rep.) for: - nationals of China (People's Rep.) arriving from China (People's Rep); and - visa required nationals arriving from China (People's Rep.). \n5. Visitors arriving from Japan who have been in the cruise ship 'Diamond Princess' are not allowed to transit or enter (Korea Rep.). \n6. Visas issued to nationals of Japan (at Korean Diplomatic Missions in Japan) before 9 March 2020 are invalidated. \n- This does not apply to visas issued outside Japan. Such visas remain valid. \n- This does not apply to airline crew. \n7. Nationals of Japan who do not hold a Korean visa issued on or after 9 March 2020 will not be allowed entry. \n8. Passengers arriving from any country will be subject to quarantine procedures. They must install a self-diagnosis application in their personal device and a completed Health Declaration Form and a Special Quarantine Declaration Form must be presented to the quarantine desk upon arrival.\n- This does not apply to airline crew."
},
{
    "id": "KW",
    "name": "Kuwait",
    "nationalBans":["*"],
    "tooltip":"1. All passengers are not allowed to enter Kuwait.\n\n- This does not apply to nationals and residents of Kuwait.\n\n- This does not apply to the immediate relatives and the domestic workers of nationals of Kuwait.\n\n2. Nationals of Kuwait are allowed to enter with a national ID card if they used the card when they departed from Kuwait.\n\n3. Nationals of Kuwait who have been in Bangladesh, China (People’s Rep.), Egypt, Hong Kong (SAR China), India, Iran, Iraq, Italy, Japan, Korea Rep., Lebanon, Philippines, Singapore, Sri Lanka, Syria or Thailand in the past 14 days must:\n\n- obtain prior approval to enter from Kuwait Immigration Authorities, and\n\n- complete Ministry of Health’s form of acknowledgement.\n\n4. Immediate family members of nationals of Kuwait are allowed to enter if:\n\n- traveling with the national of Kuwaiti, or\n\n- prior approval to enter is obtained from Kuwait Immigration Authorities.\n\n5. Domestic personnel are allowed to enter Kuwait if traveling with the Kuwaiti Sponsor."
},
{
    "id": "KY",
    "name": "Cayman Islands",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"1. Passengers are not allowed to enter Cayman Isl. \n- This does not apply to passengers who reside in Cayman Isl.\n- This does not apply to passengers arriving from the United Kingdom.\n2. Passengers who reside in Cayman Isl. will be isolated for 14 days.\n3. Passengers arriving from the United Kingdom will be isolated for 14 days."
},
{
    "id": "KZ",
    "name": "Kazakhstan",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter and exit from/to Kazakhstan starting from 08:00 of 16 March 2020, until further notice (official source http://www.mfa.kz/en/).\n- This does not apply to nationals of Kazakhstan, who left the country – upon their return.\n- This does not apply to nationals of Kazakhstan, who travelling abroad for treatment – supporting documents from medical institutes are required.\n- This does not apply to foreigners departing from Kazakhstan\n- This does not apply to staff of the diplomatic service of Kazakhstan and foreign states and members of their families, as well as members of delegations of foreign states and international organizations traveling to Kazakhstan at the invitation of the Ministry of Foreign Affairs of the Republic of Kazakhstan;\n- This does not apply to crewmembers of train, locomotive, aircraft and sea crews;\n- This does not apply to service personnel of foreign cross-border facilities on the territory of Kazakhstan and service personnel of Kazakh cross-border facilities on the territory of neighboring states;\n- This does not apply to foreigners (stateless persons), holders of Kazakh residence permits;\n- This does not apply to foreigners who are family members of citizens of Kazakhstan (subject to confirmation of kinship – spouses, parents and children)."
},
{
    "id": "LA",
    "name": "Laos"
},
{
    "id": "LB",
    "name": "Lebanon",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Flights to Lebanon are suspended until 12 April 2020.\n- This does not apply to diplomatic delegations working in Lebanon.\n- This does not apply to International Organizations personnel.\n- This does not apply to UNIFIL forces and personnel working for companies associated with drilling operations in Block No. 4."
},
{
    "id": "LC",
    "name": "Saint Lucia",
    "nationalBans":["*"],
    "tooltip":"All airports are closed until 5 April 2020."
},
{
    "id": "LI",
    "name": "Liechtenstein"
},
{
    "id": "LK",
    "name": "Sri Lanka",
    "nationalBans":["*"],
    "tooltip":"All airports are closed until 07 April 2020."
},
{
    "id": "LR",
    "name": "Liberia"
},
{
    "id": "LS",
    "name": "Lesotho"
},
{
    "id": "LT",
    "name": "Lithuania",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Lithuania\n\n-This does not apply to nationals of Lithuania\n\n-This does not apply to residents of Lithuania\n\n2.Returning nationals and residents of Lithuania are subject to 14 days isolation.\n\n3.Transit through Lithuania is only possible for passengers returning to their country of residence."
},
{
    "id": "LU",
    "name": "Luxembourg",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Luxembourg until the 17 April 2020.\n\n- This does not apply to nationals of Luxembourg and their family members in order to return home.\n\n- This does not apply to nationals of the European Union, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members in order to return home.\n\n- This does not apply to passengers who have a long-term resident status in accordance with the European Directive 2003/109 / EC relating to long-term residents, as well as any other person who have a right of residence in accordance with European directives as well as national law in Grand Duchy of Luxembourg or one of the neighboring countries.\n\n- This does not apply to healthcare professionals, health researchers and healthcare professionals to the elderly.\n\n- This does not apply to cross-border workers.\n\n- This does not apply to members of the diplomatic corps, personnel of international organizations, the military, personnel of the development cooperation and humanitarian aid, during the exercise of their respective functions.\n\n- This does not apply to passenger travelling by land to their country of origin. They must have a proof of onward journey.\n\n- This does not apply to passengers traveling for urgent and duly justified family reasons.\n\n- This does not apply to passengers who want to apply for international protection or subsidiary protection in the Grand Duchy of Luxembourg or for other humanitarian reasons."
},
{
    "id": "LV",
    "name": "Latvia",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to transit or enter Latvia.\n- This does not apply to nationals and permanent residents of Latvia."
},
{
    "id": "LY",
    "name": "Libya"
},
{
    "id": "MA",
    "name": "Morocco"
},
{
    "id": "MC",
    "name": "Monaco"
},
{
    "id": "MD",
    "name": "Moldova",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Moldova (Rep.).\n\n- This does not apply to nationals and residents of Moldova (Rep.)."
},
{
    "id": "ME",
    "name": "Montenegro",
    "bans":{"CN":-1, "IR":-1, "IT":-1, "KR":-1, "ES":-1},
    "tooltip":"Passengers arriving from Hubei Province of China (People's Rep.), Iran, Italy, Korea (Rep.) or Spain are not allowed to enter. \n- This does not apply to nationals of Montenegro."
},
{
    "id": "MF",
    "name": "Saint Martin"
},
{
    "id": "MG",
    "name": "Madagascar",
    "bans":{"CN":-14, "IR":-14, "IT":-14, "KR": -14},
    "tooltip":"Passengers and airline crew who have transited through or have been in China (People's Rep.), Iran, Italy, Korea Rep. in the past 14 days are not allowed to enter Madagascar."
},
{
    "id": "MH",
    "name": "Marshall Islands",
    "nationalBans":["*"],
    "tooltip":"International passengers are not allowed to enter Marshall Isl. until 5 April 2020 "
},
{
    "id": "MK",
    "name": "Macedonia",
    "nationalBans":["*"],
    "tooltip":"North Macedonia (Rep.) borders are closed.\n\n- This does not apply to nationals and residents of North Macedonia (Rep.).\n\n- This does not apply to accredited diplomats.\n\n- This does not apply to passengers with a special permit issued by the Ministry of Interior of North Macedonia (Rep.)."
},
{
    "id": "ML",
    "name": "Mali"
},
{
    "id": "MM",
    "name": "Myanmar",
    "nationalBans":["*"],
    "tooltip":"All international flights are not allowed to land in Myanmar until 13 April 2020 (23:59 - Myanmar Standard Time).\n- This does not apply to relief flights;\n- This does not apply to medical evacuation flights;\n- This does not apply to special flights approved by the Department of Civil Aviation."
},
{
    "id": "MN",
    "name": "Mongolia",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Mongolia until the 30 April 2020.\n- This does not apply to nationals of Mongolia. \n- This does not apply to residents of Mongolia who are direct family members of a national of Mongolia. \n2. Nationals of Mongolia will be placed in quarantine for 14 days. \n3. Residents of Mongolia who are direct family members of a national of Mongolia will be placed in quarantine for 14 days"
},
{
    "id": "MO",
    "name": "Macao",
    "restrictions":{"CN":-14, "IR":-14, "IT":-14, "KR":-14},
    "tooltip":"1. Visitors who reside or have been in the Hubei Province (Chine People's Rep.) in the past 14 days are not allowed to enter Macao (SAR China) unless they prove with a valid certificate that they are not infected with the Coronavirus (COVID-19).\n\n2. Passengers with a Macao (SAR China) passport and those residing in Macao (SAR China) who have been in the Hubei Province (Chine People's Rep.) in the past 14 days must fill-in a Health Declaration Form.\n3. Passengers who have been in Iran, Italy or Korea (Rep.) will be subject to quarantine for 14 days."
},
{
    "id": "MP",
    "name": "Northern Mariana Islands",
    "nationalRestrictions":["*"],
    "tooltip":"1. Passengers arriving in Saipan from a country with an identified COVID-19 outbreak, inclusive of Guam, Hawaii, and the continental USA, will be required to quarantine for 14 consecutive days at a hotel property. This applies to both residents and non-residents. \n\n2. Passengers who need to leave the island prior to the 14-day period will be allowed to depart back to Guam.  \n\n3. Passengers will complete a health form prior to landing in Saipan. Public Health will meet the passengers in the terminal prior to arrival at the customs hall. Passengers will then proceed to the bus where they will be taken to a hotel property for quarantine.\n\n4. Airline crew, with return flights within less than 14 days of arrival will be allowed to depart Northern Mariana Isl. \n\n5. Passengers entering into the Northern Mariana Isl. by air transport, whose ultimate destination is the island of Tinian or the island of Rota, shall exercise the 14-day quarantine on the island of Saipan before traveling to Tinian or Rota. "
},
{
    "id": "MQ",
    "name": "Martinique"
},
{
    "id": "MR",
    "name": "Mauritania",
    "nationalBans":["*"],
    "tooltip":"All airports in Mauritania are closed."
},
{
    "id": "MS",
    "name": "Montserrat",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Montserrat.\n- This does not apply to passengers from Montserrat;\n- This does not apply to passengers who have a permit of permanent residence;\n- This does not apply to airline crew;\n- This does not apply to husband, wife, child or other dependents of a person who is from or reside in Montserrat."
},
{
    "id": "MT",
    "name": "Malta",
    "nationalBans":["*"],
    "tooltip":"Flights to Malta are suspended"
},
{
    "id": "MU",
    "name": "Mauritius",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Mauritius until 2 April 2020, 6:00GMT.\n- This does not apply to nationals of Mauritius, their spouses and children. They will be placed in quarantine"
},
{
    "id": "MV",
    "name": "Maldives",
    "nationalsExcempt":true,
    "bans":{"BD":-14, "CN":-14, "IR":-14, "IT":-14, "MT":-14, "ES":-14, "GB":-14, "KR":-14, "FR":-14, "DE":-14},
    "tooltip":"1. Passengers and airline crew who have been in Bangladesh, China (People's Rep.), Iran, Italy, Malaysia, Spain, Sri Lanka, United Kingdom or in North Gyeongsang and South Gyeongsang Provinces in Korea (Rep.), Ile-de-France and Grand Est (regions of France) and Bavaria, North Rhine Westphalia and Baden-Wuerttemberg (regions of Germany) in the past 14 days are not allowed to enter the Maldives.\n- This does not apply to nationals of Maldives and their spouses. \n2. A completed \"Health Declaration Card\" and an \"Immigration Arrival Card\" must be presented upon arrival."
},
{
    "id": "MW",
    "name": "Malawi"
},
{
    "id": "MX",
    "name": "Mexico"
},
{
    "id": "MY",
    "name": "Malaysia",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Malaysia.\n- This does not apply to nationals of Malaysia.\n- This does not apply to permanent residents of Malaysia.\n- This does not apply to passengers with a diplomatic passport.\n2.Nationals and residents of Malaysia are required to be self-quarantined for 14 days."
},
{
    "id": "MZ",
    "name": "Mozambique"
},
{
    "id": "NA",
    "name": "Namibia",
    "nationalBans":["*"],
    "tooltip":"Namibia's borders are closed until 23 April 2020."
},
{
    "id": "NC",
    "name": "New Caledonia",
    "nationalBans":["*"],
    "tooltip":"Flights to New Caledonia are suspended until 31 March 2020."
},
{
    "id": "NE",
    "name": "Niger"
},
{
    "id": "NF",
    "name": "Norfolk Island"
},
{
    "id": "NG",
    "name": "Nigeria"
},
{
    "id": "NI",
    "name": "Nicaragua"
},
{
    "id": "NL",
    "name": "Netherlands"
},
{
    "id": "NO",
    "name": "Norway",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Norway. \n- This does not apply to nationals and residents of Norway. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are residing or working in Norway.\n- This does not apply to airline crew. \n- This does not apply to passengers in transit. \n- This does not apply to passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons. \n2. The following passengers must undergo a 14-day home quarantine:\n- nationals and residents of Norway;\n- nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are residing or working in Norway;\n- passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons.\n3. All crew and passengers must fill out the public health information form and hand it over to the local airport authority upon arrival."
},
{
    "id": "NP",
    "name": "Nepal",
    "nationalBans":["*"],
    "tooltip":"All international flights to Nepal are suspended until 15 April 2020."
},
{
    "id": "NR",
    "name": "Nauru",
    "bans":{"CN":-21, "HK":-21, "IR":-21, "IT":-21, "KR":-21, "MO":-21},
    "tooltip":"Passengers who have transited through or have been in China (People's Rep.), Hong Kong (SAR China), Italy, Korea (Rep.) or Macao (SAR China) in the past 21 days will not be allowed to enter Nauru."
},
{
    "id": "NU",
    "name": "Niue",
    "bans":{"CN":-30, "SCH":-30, "TW":-30, "SG":-30, "MO":-30, "JP":-30, "KR":-30, "US":-30, "TH":-30, "GB":-30},
    "tooltip":"Passengers who have been in Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Indonesia, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Macao (SAR China), Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, USA or United Kingdom in the past 14 days are not allowed to enter Niue.\n- This does not apply to nationals and resident of Niue and to airline crew."
},
{
    "id": "NZ",
    "name": "New Zealand",
    "nationalBans":["*"],
    "tooltip":"1. New Zealand borders are closed.\n- This does not apply to nationals of New Zealand, permanent residents and residents with valid travel conditions, and their immediate family.\n- This does not apply to nationals Australia and permanent residents if New Zealand is their primary place of established residence.\n- This does not apply to diplomats accredited to New Zealand and currently resident in New Zealand.\n2. Nationals of New Zealand, permanent residents and residents with valid travel conditions and their immediate family, diplomats accredited to New Zealand and currently resident in New Zealand will be subject to self-isolation for 14 days."
},
{
    "id": "OM",
    "name": "Oman",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Oman. \n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates. \n- This does not apply to passengers with a resident visa issued by Oman. \nNationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, United Arab Emirates and passengers with a resident visa issued by Oman will be placed in quarantine for a minimum of 14 days."
},
{
    "id": "PA",
    "name": "Panama",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Panama.\n- This does not apply to nationals of Panama.\n- This does not apply to passengers who reside in Panama.\n2. Nationals and residents of Panama must be in home quarantine for 14 days."
},
{
    "id": "PE",
    "name": "Peru",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Peru."
},
{
    "id": "PF",
    "name": "Polynesia",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter French Polynesia. \n- This does not apply to passengers who reside in French Polynesia"
},
{
    "id": "PG",
    "name": "Papua New Guinea",
    "bans":{"CN":-14, "IR":-14, "IT":-14, "JP":-14, "KR":-14},
    "tooltip":"Passengers who have been in China (People's Rep.), Iran, Italy, Japan or Korea (Rep.) in the past 14 days are not allowed to enter Papua New Guinea. They must have spent 14 consecutive days in a country that is free from Coronavirus (COVID-19)."
},
{
    "id": "PH",
    "name": "Philippines",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"1. Passengers who have transited through or have been in China (People’s Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter the Philippines. \n- This does not apply to nationals of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n- This does not apply to spouses or children of nationals of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n- This does not apply to permanent residents of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n2.Passengers who have transited through or have been in the North Gyeongsang Province (including Daegu and Cheongdo Country) of Korea (Rep.) in the past 14 days are not allowed to enter the Philippines. \n- This does not apply to nationals of the Philippines. \n- This does not apply to spouses or children of nationals of the Philippines. \n- This does not apply to permanent residents of the Philippines. \n3. Passengers who have transited through or have been in Iran or Italy in the past 14 days are required to present a Medical Clearance or Health Declaration Certificate, issued by Health Authority within 48 hours prior to arrival and certifying that the passenger is free from Coronavirus (COVID-19).\n- This does not apply to nationals of the Philippines. \n- This does not apply to spouses or children of nationals of the Philippines. \n- This does not apply to permanent residents of the Philippines. \nPassengers who have transited through or have been in Iran or Italy in the past 14 days, are required to undergo a 14-day quarantine.\nEffective 22 March 2020, passengers under the following visa categories are not allowed to enter the Philippines:\n- Passengers under Visa Waiver Agreements.\n- Passengers with Special Visas\n- Passengers who fall under Executive Order No.408, s1960 (EO408);\n- Passengers with a Hong Kong (SAR China) passport, Macao (SAR China) passport, Macao-Portuguese, and British National Overseas passports.\n- Immigrant and non-Immigrant visa holders (i.e. 13, 9D, 9F, 9G, 47a(2), etc.)\nThis does not apply to:\n- Foreign spouses and children of Filipino nationals (if they are not traveling together, they should show proof of marriage or filiation).\n- Foreign government and International Organization officials whose visas were issued by the Philippines government.\n- Foreign crew members."
},
{
    "id": "PK",
    "name": "Pakistan",
    "nationalBans":["*"],
    "tooltip":"All international flights to Pakistan are suspended until 4 April 2020."
},
{
    "id": "PL",
    "name": "Poland",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"Passengers are not allowed to enter Poland.\n\n \n\nEntry into Poland is still allowed for:\n\na)               Nationals of Poland, their spouses and children.\n\nb)               Passengers who are under permanent custody of nationals of Poland.\n\nc)                Passengers with a temporary or permanent residence permit.\n\nd)               Passengers with a Pole's Card.\n\ne)               Passengers with a voivode's permit to enter a voivodship to which they are traveling.\n\nf)                 Heads of diplomatic missions and members of the diplomatic and consular personnel of a mission (with a diplomatic rank).\n\ng)               Airline crew."
},
{
    "id": "PM",
    "name": "Saint Pierre and Miquelon"
},
{
    "id": "PN",
    "name": "Pitcairn"
},
{
    "id": "PR",
    "name": "Puerto Rico"
},
{
    "id": "PS",
    "name": "Palestine"
},
{
    "id": "PT",
    "name": "Portugal",
    "nationalBans":["*"],
    "tooltip":"Flights to Portugal are suspended until 17 April 2020.\n-This does not apply to flights arriving from Angola, Austria, Belgium, Brazil (Sao Paulo (GRU) and Rio De Janeiro (RIO) airports only), Bulgaria, Canada, Cape Verde, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Guinea-Bissau, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Mozambique, Netherlands, Norway, Poland, Portugal, Romania, Sao Tome and Principe, Slovakia, Slovenia, South Africa, Spain, Sweden, Switzerland, USA, United Kingdom or Venezuela.\n- This does not apply to flights bringing back nationals and residence of Portugal."
},
{
    "id": "PW",
    "name": "Palau",
    "bans":{"CN":-14, "HK":-14, "MO":-14},
    "tooltip":"Passengers who have transited through or have been in China (People's Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter Palau."
},
{
    "id": "PY",
    "name": "Paraguay",
    "nationalBans":["*"],
    "tooltip":"Flights to Paraguay are suspended until 12 April 2020."
},
{
    "id": "QA",
    "name": "Qatar",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Qatar.\n- This does not apply to nationals of Qatar."
},
{
    "id": "RE",
    "name": "Reunion"
},
{
    "id": "RO",
    "name": "Romania"
},
{
    "id": "RS",
    "name": "Serbia",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Serbia.\n- This does not apply to nationals of Serbia. \n- This does not apply to residents of Serbia.\n- This does not apply to accredited diplomats and passengers with a special permission issued by the Ministry of Health, the Ministry of Foreign Affairs, the Ministry of Interior or the Ministry of Construction, Transport and Infrastructure. \n2. Nationals and residents of Serbia arriving from any country are required to self-isolate for a period of 14 days. \n- This does not apply when arriving from Austria, France, Germany, Greece, Iran, Italy, Romania, Slovenia, Spain or Switzerland.\n3. Nationals and residents of Serbia arriving from Austria, France, Germany, Greece, Iran, Italy, Romania, Slovenia, Spain or Switzerland are required to self-isolate for a period of 28 days."
},
{
    "id": "RU",
    "name": "Russian Federation",
    "nationalBans": ["*"],
    "tooltip": "Passengers are not allowed to enter the Russian Fed. \n- This does not apply to nationals of the Russian Fed.; \n- This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members;\n- This does not apply to airline crew;\n- This does not apply to members of official delegations;\n- This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs;\n- This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations;\n- This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status;\n- This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed."
},
{
    "id": "RW",
    "name": "Rwanda"
},
{
    "id": "SA",
    "name": "Saudi Arabia",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"Passengers are not allowed to enter Saudi Arabia.\n\n-This does not apply to nationals of Saudi Arabia."
},
{
    "id": "SB",
    "name": "Solomon Islands",
    "nationalBans":["*"],
    "tooltip":"1. Passengers who have transited through or have been in Austria, Bahrain, Belgium, China (People's Rep.), Chinese Taipei, Denmark, France, Germany, Greece, Hong Kong (SAR China), Indonesia, Iran, Israel, Italy, Japan, Korea (Rep.), Kuwait, Macao (SAR China), Malaysia, Netherlands, Norway, Qatar, Singapore, Spain, Sweden, Switzerland or Thailand in the past 14 days are not allowed to enter Solomon Isl.\n\n- This does not apply to nationals of Solomon Isl.\n\n2. Passengers who have transited through or have been in Afghanistan, Algeria, Andorra, Argentina, Armenia, Australia, Azerbaijan, Bangladesh, Belarus, Bhutan, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Burkina Faso, Cambodia, Cameroon, Canada, Chile, Colombia, Congo (Dem. Rep.), Costa Rica, Cote d'Ivoire, Cyprus, Czechia, Dominican Rep., Ecuador, Egypt, Estonia, Finland, French Guiana, French Polynesia, Georgia, Gibraltar, Honduras, Hungary, Iceland, India, Ireland (Rep.), Jamaica, Jordan, Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Maldives, Mexico, Moldova (Rep.), Monaco, Mongolia, Morocco, Nepal, New Zealand, Nigeria, North Macedonia (Rep.), Oman, Pakistan, Palestinian Territory, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Romania, Russian Fed., San Marino, Saudi Arabia, Senegal, Serbia, Sierra Leone, Slovenia, South Africa, Sri Lanka, Togo, Turkey, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days may be subject to immediate quarantine or isolation as applicable."
},
{
    "id": "SC",
    "name": "Seychelles",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"1. The international airport in Seychelles is closed to all international flights.\n- This does not apply to repatriation flights of foreign nationals from Seychelles.\n- This does not apply to emergency diversions.\n- This does not apply to special mission flights that are approved (MEDEVAC).\n2. Passengers are not allowed to enter Seychelles.\n- This does not apply to passengers who require to enter Seychelles on special mission and have a permission from the Public Health Commissioner before departure. \n- This does not apply to crew members requiring minimum rest. They must undergo strict mandatory quarantine during the rest period. \n- This does not apply to any other person under other circumstances as approved by the Public Health Commissioner."
},
{
    "id": "SD",
    "name": "Sudan",
    "nationalBans":["*"],
    "tooltip":"All airports in Sudan are closed.\n- This does not apply to humanitarian aid, medical and relief flights."
},
{
    "id": "SE",
    "name": "Sweden",
    "nationalBans":["*"],
    "tooltip":"Passengers not arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain or Switzerland are not allowed to enter.\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland and their family members. \n- This does not apply to passengers with a British passport and their family members.\n- This does not apply to passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.\n- This does not apply to passengers with a permanent residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or United Kingdom.\n- This does not apply to passengers with a national visa issued by Sweden. \n- This does not apply to the following passengers:\na. healthcare personnel;\nb. border workers;\nc. personnel transporting goods and other personnel in the transport sector to the necessary extent;\nd. persons covered by Chapter 2. Section 10 of the Aliens Act (2005: 716);\ne. persons working in international organizations, military personnel and relief workers;\nf. passengers in transit; \ng. persons with urgent family reasons;\nh. persons in need of international protection or for other humanitarian reasons."
},
{
    "id": "SG",
    "name": "Singapore",
    "nationalBans":["*"],
    "tooltip":"1. Passengers traveling as short-term visitors are not allowed to transit or enter Singapore. \n-This does not apply to returning residents of Singapore (Singapore Citizens, Permanent Residents or Long-Term Pass Holders(including holders of Work Pass, Student's Pass, Dependant's Pass, and Long-Term Visit Pass)). If they have been in Hubei Province (China People's Rep.) within the last 14 days, they will be quarantined for 14 days upon entry into Singapore. For others, they will be issued a 14-day Stay-Home-Notice (SHN) upon entry into Singapore. \n2. New and existing work pass holders are only allowed to enter Singapore with the Ministry of Manpower's (MOM) prior approval. They are required to show the MOM's approval letter to airline staff upon check-in and before boarding, as well as to the Immigration & Checkpoint Authority (ICA) officers at the immigration checkpoint upon their arrival in Singapore. \n3. Passengers with an Approved Letter for Entry from ICA will not be subjected to the above restrictions. However, they may still be subjected to the prevailing health screening requirement upon arriving at a Singapore airport. Possession of an Approved Letter for Entry does not guarantee the issuance of a Visit Pass to enter Singapore. \n4. All travellers entering Singapore, including Singapore Citizens, Permanent Residents and Long-Term Pass (LTP) holders, must submit a health declaration before proceeding with immigration clearance. They will have to do so via the SG Arrival Card (SGAC) e-Service, at https://eservices.ica.gov.sg/sgarrivalcard or the mobile application that can be downloaded for free from Apple AppStore and Google Play. \n5. Airlines are requested to inform passengers at the various touchpoints (e.g. at check-in and before boarding at point of departure, in-flight) to submit their health declaration via the SGAC e-Service prior to their arrival in Singapore.\nThe paper-based embarkation/disembarkation card will be discontinued. As such, all airlines operating into Singapore can stop distributing these cards for all flights with scheduled time of arrival (STA) into Singapore on or after 27 March 2020, 0900 hours."
},
{
    "id": "SH",
    "name": "Saint Helena, Ascension and Tristan da Cunha",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter St. Helena.\n- This does not apply to passengers who reside in St. Helena.\n- This does not apply to passengers with a long-term permit.\n- This does not apply to temporary contractors.\n- This does not apply to sponsor Technical Cooperation Officers.\n- This does not apply to passengers to Ascension.\n- This does not apply to persons authorized in advance by the Governor.\n2. Self-isolation for 14 days is mandatory when entering St. Helena."
},
{
    "id": "SI",
    "name": "Slovenia"
},
{
    "id": "SJ",
    "name": "Svalbard and Jan Mayen"
},
{
    "id": "SK",
    "name": "Slovakia",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Slovakia.\n-This does not apply to nationals and residents of Slovakia. They must remain in quarantine for 14 days upon arrival."
},
{
    "id": "SL",
    "name": "Sierra Leone",
    "restrictions":{"CN":-14},
    "tooltip":"Passengers who have transited through or have been in China (People's Rep.) in the past 14 days, will be subject to immediate quarantine."
},
{
    "id": "SM",
    "name": "San Marino"
},
{
    "id": "SN",
    "name": "Senegal"
},
{
    "id": "SO",
    "name": "Somalia",
    "bans":{"CN":-14},
    "tooltip":"1. Passengers who have been in China (People's Rep.) in the past 14 days are not allowed to enter Somalia.\n\n2. Residents of Somalia who have been in China (People's Rep) are subject to immediate quarantine for a maximum of 14 days."
},
{
    "id": "SR",
    "name": "Suriname"
},
{
    "id": "SS",
    "name": "South Sudan"
},
{
    "id": "ST",
    "name": "Sao Tome and Principe"
},
{
    "id": "SV",
    "name": "El Salvador",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"Passengers are not allowed to enter El Salvador.\n\n- This does not apply to nationals of El Salvador.\n\n- This does not apply to passengers who reside in El Salvador.\n\n- This does not apply to passengers with a diplomatic, official, service or special passport and their immediate family members."
},
{
    "id": "SX",
    "name": "Sint Maarten",
    "nationalBans":["*"],
    "nationalsExcempt":true,
    "tooltip":"1. Passengers are not allowed to enter St. Maarten. \n-This does not apply to residents of St. Maarten or Saint Martin (FWI). They must hold a proof of residence, which can be a St. Maarten/ Saint Martin driving license or a St. Maarten ID/ Saint Martin carte d'identite or a St. Maarten/Saint Martin registration document.\n-This does not apply to airline crew. \n-This does not apply to passengers who are specialists with evidence of traveling at the invitation of the Government of St. Maarten. \n2. Residents of St. Maarten must self-quarantine for 14 days. \n3. Airline crew that are overnighting must undergo a mandatory self-quarantine."
},
{
    "id": "SY",
    "name": "Syria"
},
{
    "id": "SZ",
    "name": "Swaziland"
},
{
    "id": "TC",
    "name": "Turks and Caicos Islands",
    "nationalsExcempt":true,
    "bans":{"SCH":-21, "CN":-21, "IR":-21, "IT":-21, "JP":-21, "KR":-21, "MO":-21, "SG":-21},
    "tooltip":"1. Passengers who have been in Austria, Belgium, Czechia, China (People's Rep.), Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Singapore or Vatican City in the past 21 days are not allowed to enter Turks and Caicos.\n- This does not apply to nationals and residents of Turks and Caicos.\n2. Nationals and residents of Turks and Caicos who have been in Austria, Belgium, Czechia, China (People's Rep.), Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Singapore or Vatican City in the past 21 days are subject to quarantine for 14 days."
},
{
    "id": "TD",
    "name": "Chad"
},
{
    "id": "TF",
    "name": "French Southern Territories"
},
{
    "id": "TG",
    "name": "Togo"
},
{
    "id": "TH",
    "name": "Thailand",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Thailand.\n- This does not apply to nationals of Thailand. \n- This does not apply to airline crew with pre-existing schedules.\n- This does not apply to diplomats and their family members.\n- This does not apply to passengers with a work permit.\n- This does not apply to passengers with a waiver from Prime Minister or People In Charge of State of Emergency.\n2. Passengers must have the ‘fit-to-fly' health certificate to transit Thailand. The transit time must not be more than 24 hours.\n3. Nationals of Thailand and those who can enter Thailand must have a letter from the Embassy with the ‘fit-to-fly' health certificate."
},
{
    "id": "TJ",
    "name": "Tajikistan",
    "bans":{"AF":-14, "CN":-14, "IR":-14, "IT":-14, "KR":-14},
    "nationalsExcempt":true,
    "tooltip":"Passengers who have transited through or have been in Afghanistan, China (People’s Rep.), Iran, Italy or Korea (Rep.) in the past 14 days are not allowed to transit or enter Tajikistan.\n\n- This does not apply to nationals of Tajikistan."
},
{
    "id": "TK",
    "name": "Tokelau"
},
{
    "id": "TL",
    "name": "Timor-Leste"
},
{
    "id": "TM",
    "name": "Turkmenistan",
    "nationalBans":["AF", "AU", "BH", "BE", "KH", "CA", "CN", "HR", "FI", "FR", "GE", "DE", "IN", "IR", "IQ", "IL", "IT", "JP", "KR", "KW", "LY", "MY", "NE", "MC", "NO", "OM", "PK", "PH", "RU", "SG", "ES", "LK", "SE", "TH", "US", "AE", "VN", "GB"],
    "tooltip":"1. Nationals of Afghanistan, Australia, Bahrain, Belgium, Cambodia, Canada, China (People's Rep.), Croatia, Finland, France, Georgia, Germany, India, Iran, Iraq, Israel, Italy, Japan, Korea (Rep.), Kuwait, Libya, Malaysia, Nepal, North Macedonia (Rep.), Norway, Oman, Pakistan, Philippines, Russian Fed., Singapore, Spain, Sri Lanka, Sweden, Thailand, USA, United Arab Emirates and Viet Nam are not allowed to enter Turkmenistan.\n\n2. Passengers with a British passport are not allowed to enter Turkmenistan.\n\n3. Passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport are not allowed to enter Turkmenistan.\n\n4. Passengers with a Hong Kong (SAR China) passport are not allowed to enter Turkmenistan.\n\n5. Passengers with a Macao (SAR China) passport are not allowed to enter Turkmenistan."
},
{
    "id": "TN",
    "name": "Tunisia",
    "bans":{"CN":-14, "IR":-14, "IT":-14, "KR":-14},
    "tooltip":"1. Passengers who have been in China (People's Rep.), Iran, Italy or Korea (Rep.) in the past 14 days are not allowed to transit or enter Tunisia.\n\n- This does not apply to nationals of Tunisia, their partners and children.\n\n2. Nationals of Tunisia, their partners and children who have been in China (People's Rep.), Iran, Italy or Korea (Rep.) in the past 14 days will be put in quarantine for 14 days."
},
{
    "id": "TO",
    "name": "Tonga",
    "bans":{"CN":-1, "TW":-1, "HK":-1, "MO":-1},
    "nationalsExcempt":true,
    "tooltip":"1. Passengers and airline crew arriving from or transiting through China (People's Rep.), Chinese Taipei, Hong Kong (SAR China) or Macao (SAR China) are not allowed to enter Tonga. This does not apply if they have stayed in a country with no confirmed cases of Coronavirus (COVID-19) for a period of minimum 14 days before entering Tonga. They must have an official medical clearance undertaken within 3 days prior to arrival in Tonga.\n\n- This does not apply to nationals of Tonga and their immediate family members.\n\n- This does not apply to permanent residents of Tonga and their immediate family members.\n\n- This does not apply to airline crew on direct flights from China (People's Rep.) who have been using appropriate personal protective equipment (PPE).\n\n2. Passengers must complete a 'Traveler's Arrival Health Declaration Card' and submit it to the Ministry of Health Border Control when arriving in Tonga."
},
{
    "id": "TR",
    "name": "Turkey",
    "nationalsExcempt":true,
    "nationalRestrictions":["*"],
    "nationalBans":["AT", "BE", "CN", "DK", "EG", "FR", "DE", "NL", "IR", "IQ", "IE", "IT", "KR", "NL", "NO", "SA", "ES", "SE", "CH", "AE"],
    "bans":{"AT":-14, "BE":-14, "CN":-14, "DK":-14, "FR":-14, "DE":-14, "IR":-14, "IQ":-14, "IT":-14, "KR":-14, "NL":-14, "NO":-14, "ES":-14, "SE":-14},
    "tooltip":"1. Nationals of Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Cameroon, Canada, Chad, China (People's Rep.), Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Germany, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates and Uzbekistan are not allowed to enter Turkey.\n\n2. Passengers with a British passport are not allowed to enter Turkey.\n\n3. Passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport are not allowed to enter Turkey.\n\n4. Passengers who have transited or have been in Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Germany, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey.\n\n5. Passengers arriving from Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Germany, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey.\n\n6. All passengers who traveled to the above restricted countries during the last 14 days are prohibited to be accepted to all flights to Turkey. Otherwise, all passengers on the flights will be quarantined for 14 days."
},
{
    "id": "TT",
    "name": "Trinidad and Tobago",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Airports in Trinidad and Tobago are closed until 30 April 2020.\n- This does not apply if permitted by the Minister with responsibility for national security."
},
{
    "id": "TV",
    "name": "Tuvalu",
    "nationalBans":["*"],
    "tooltip":"Tuvalu's borders are closed."
},
{
    "id": "TW",
    "name": "Taiwan",
    "nationalBans": ["*"],
    "tooltip":"1. Passengers are not allowed to enter Chinese Taipei.\n- This does not apply to passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport.\n- This does not apply to passengers with an Alien Resident Certificate.\n- This does not apply to personnel on diplomatic or official business.\n- This does not apply to passengers who can prove they are fulfilling commercial and contractual obligations, or passengers requiring special permission. \n- This does not apply to passengers with a visa with \"SPECIAL ENTRY PERMIT FOR COVID-19 OUTBREAK\" stated on remarks. \n2. Passengers who can enter must observe a 14-day home quarantine upon arrival."
},
{
    "id": "TZ",
    "name": "Tanzania, United Republic of",
    "nationalRestrictions":["*"],
    "tooltip":"1. All passengers and airline crew must undergo quarantine for 14 days at their own expense.\n\n2. A completed \"Health Form\" must be presented to the Ministry of Health personnel upon arrival."
},
{
    "id": "UA",
    "name": "Ukraine",
    "nationalBans":["*"],
    "tooltip":"Passengers will not be allowed to enter or transit Ukraine until 3 April 2020.\n\n-This does not apply to nationals of Ukraine, to residents of Ukraine, to spouses and children of Ukrainian nationals, to (accredited) representatives of official international and diplomatic organizations (and their family members), to crewmembers, and to representatives of humanitarian missions (and their family members).\nOn 17 March 2020, at 00:00 local time (GMT+2), all border crossing points will be closed (for any international border crossing) until 3 April 2020. This does not apply to border crossings required to safeguard national interests, and to representatives of diplomatic organizations and humanitarian missions."
},
{
    "id": "UG",
    "name": "Uganda",
    "nationalBans":["*"],
    "tooltip":"All international flights to Uganda are suspended until 24 April 2020.\n- This does not apply to:\n1. Aircraft in a state of emergency.\n2. Operations related to humanitarian aid, medical and relief flights.\n3. Technical landings where passengers do not disembark.\n4. Any other flight that may be so approved by the appropriate authority."
},
{
    "id": "UM",
    "name": "United States Minor Outlying Islands"
},
{
    "id": "US",
    "name": "United States of America",
    "bans":{"CN":-14, "IR":-14, "SCH":-14},
    "tooltip":"1. Passengers who have transited or have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or in the United Kingdom (excluding overseas territories outside of Europe), in the past 14 days are not allowed to enter the USA.\n-This does not apply to:\na. nationals of the USA;\nb. permanent residents of the USA;\nc. passengers arriving in the US on flights that departed before 23:59 EDT on 13 March 2020;\nd. the spouse of a national of the USA;\ne. the souse of a permanent resident of the US;\nf. the parent/legal guardian of an unmarried and younger than 21 years national or permanent resident of the USA;\ng. the unmarried and younger than 21 years brother or sister of a national or permanent resident of the USA, who is unmarried and younger than 21 years;\nh. the child/foster child/ward of a national or permanent resident of the USA;\ni. passengers with an IR-4 or IH-4 visa;\nj. passengers with a C-1, D, or C-1/D visa;\nk. passengers with an A-1, A-2, C-2, C-3, E-1, G-1, G-2, G-3, G-4, NATO-1 through NATO-4, or NATO-6 visa;\nl. members of the U.S. Armed Forces, spouses, and children of members of the U.S. Armed Forces;\nm. passengers with evidence of traveling at the invitation of the USA government for a purpose related to the containment/mitigation of the Coronavirus (COVID-19);\nn. passengers with documents issued by the U.S. Department of Homeland Security, U.S. Customs and Border Protection, or U.S. Department of State indicating that the passenger is exempt from the restriction.\n2. Passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the USA, must arrive at one of the following airports: Atlanta (ATL), Boston (BOS), Chicago (ORD), Dallas, (DFW), Detroit (DTW), Honolulu (HNL), Los Angeles (LAX), Miami (MIA), New York (JFK or EWR), San Francisco (SFO), Seattle (SEA) and Washington (IAD)."
},
{
    "id": "UY",
    "name": "Uruguay",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Uruguay. \n- This does not apply to nationals and residents of Uruguay.\n- This does not apply to accredited diplomats. \n2. Passengers are not allowed to transit through Uruguay.\n- This does not apply to nationals and residents of Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay and Venezuela transiting through Montevideo (MVD) or Punta del Este (PDP).\n3. Nationals and residents of Uruguay, airline crew and accredited diplomats will be placed in quarantine for 14 days. \n4. Passengers can only land at Montevideo (MVD) and Punta del Este (PDP).\n5. Flights from Europe to Uruguay are suspended until 19 April 2020."
},
{
    "id": "UZ",
    "name": "Uzbekistan",
    "nationalBans":["*"],
    "tooltip":"Flights to Uzbekistan are suspended."
},
{
    "id": "VA",
    "name": "Vatican City"
},
{
    "id": "VC",
    "name": "Saint Vincent and the Grenadines",
    "bans":{"CN":-14, "HK":-14, "JP":-14, "KR":-14, "MO":-14, "SG":-14},
    "tooltip":"Passengers who have been in China (People's Rep.), Hong Kong (SAR China), Japan, Korea (Rep.), Macao (SAR China) or Singapore in the past 14 days will not be allowed to enter St. Vincent and the Grenadines."
},
{
    "id": "VE",
    "name": "Venezuela"
},
{
    "id": "VG",
    "name": "Virgin Islands, British",
    "nationalBans":["*"],
    "tooltip":"All airports are closed until 6 April 2020. International crew members on incoming vessels will be required to remain within the port facility and comply with public health measures in effect. "
},
{
    "id": "VI",
    "name": "Virgin Islands, U.S.",
    "nationalBans":["*"],
    "tooltip":"Passengers are not allowed to enter Virgin Isl. (USA) until 24 April 2020."
},
{
    "id": "VN",
    "name": "Viet Nam",
    "nationalBans":["*"],
    "tooltip":"1. Passengers are not allowed to enter Viet Nam.\n- This does not apply to nationals of Viet Nam.\n- This does not apply to passengers for diplomatic or official duty. They will be subject to mandatory medical declaration and self-isolation.\n- This does not apply to passengers who are experts, business managers or highly skilled workers. They will be subject to mandatory medical declaration and self-isolation.\n2. For transportation of nationals of Vietnam returning to Vietnam, airlines must contact the Vietnamese Diplomatic Representative agency in the local country in advance. Noi Bai International Airport (HAN) is temporarily suspending all flights.\n3. All passengers will be placed on quarantine at a designated facility for 14 days upon arrival. \n4. All visa issuances are suspended.\n5. All passengers must fill out a quarantine form prior to arrival. \n6. Passengers who travel for diplomatic or official purpose will undergo a medical examination at the border before allowed to enter Viet Nam. \n7. Nationals of Italy and Korea (Rep.) with a normal passport are no longer visa exempt. \n8. Nationals of Denmark, Finland, France, Germany, Norway, Spain, Sweden and passengers with a British passport are no longer visa exempt.\n9. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they reside in China (People's Rep.), Denmark, Finland, France, Germany, Iran, Italy, Korea (Rep.), Norway, Spain, Sweden or United Kingdom. \n10. Nationals of Belarus, Japan and Russian Fed. with a normal passport are no longer visa exempt.\n11. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they are nationals of Belarus, Japan or Russian Fed. with a normal passport. "
},
{
    "id": "VU",
    "name": "Vanuatu",
    "nationalsExcempt":true,
    "nationalBans":["*"],
    "tooltip":"Vanuatu ports of entry are closed."
},
{
    "id": "WF",
    "name": "Wallis and Futuna"
},
{
    "id": "WS",
    "name": "Samoa",
    "nationalRestrictions":["*"],
    "restrictions":{"BH":-14, "CN":-14, "TW":-14, "FR":-14, "DE":-14, "HK":-14, "IT":-14, "IR":-14, "JP":-14, "KR":-14, "KW":-14, "MO":-14, "SG":-14, "ES":-14, "TH":-14},
    "tooltip":"1. Nationals of the USA and residents of Samoa (American) who transited or have been in Arizona, California, Florida, Georgia, Hawaii, Illinois, Massachusetts, New Hampshire, New York, North Carolina, Oregon, Rhode Island, Texas, Washington or Wisconsin, are subject to Public Health screening and might be medically or home quarantined.\n\n2. Entry Permits, issued by Samoa (American) instead of visas, are suspended.\n\n- This does not apply to residents of Samoa (American) with residence permit or an Immigration Board approval.\n\n3. Passengers arriving from Samoa must:\n\n- obtain a health clearance from Ministry of Health (MOH) 3 days prior to arrival;\n\n- present a completed “DOT Travel Declaration Form” upon arrival.\n\n4. Passengers who transited or have been in countries affected by Coronavirus (COVI-19), when arriving from Hawaii, must:\n\n-spend 14 days in Hawaii; and\n\n-obtain a health clearance 3 days before arrival in Samoa (American); and\n\n-present a completed “DOT Travel Declaration Form” upon arrival; and\n\n-provide itinerary upon arrival.\n\n5. Flights from Tonga with Talofa Airways are suspended."
},
{
  "id": "XK",
  "name": "Kosovo",
  "nationalBans":["*"],
  "tooltip":"1. Passengers are not allowed to enter Kosovo (Rep.).\n- This does not apply to nationals of Kosovo (Rep.), \n- This does not apply to diplomats accredited to Kosovo (Rep.). \n- This does not apply to representatives of the NATO-Kosovo Force (KFOR) and the European Union Rule of Law Mission in Kosovo (EULEX). \n2. Passengers allowed to enter Kosovo (Rep.) are subject to mandatory quarantine for 14 days."
},
{
    "id": "YE",
    "name": "Yemen"
},
{
    "id": "YT",
    "name": "Mayotte"
},
{
    "id": "ZA",
    "name": "South Africa",
    "bans":{"CN":-1000, "FR":-1000, "DE":-1000, "IR":-1000, "IT":-1000, "KR":-1000, "ES":-1000, "US":-1000, "GB":-1000},
    "nationalRestrictions":["*"],
    "tooltip":"1. Passengers who have been in China (People's Rep.), France, Germany, Iran, Italy, Korea (Rep.), Spain, USA or United Kingdom are not allowed to transit or enter South Africa.\n- This does not apply to nationals and residents of South Africa. \n2. Passengers who have been in Hong Kong (SAR China), Portugal and Singapore are subject to extra screening.\n3. A completed health questionnaire must be presented to Port Health upon arrival."
},
{
    "id": "ZM",
    "name": "Zambia",
    "nationalRestrictions":["*"],
    "tooltip":"1. All flights must arrive at Kenneth Kaunda International Lusaka Airport (LUN).\n2. Passengers and airline crew must quarantine for at least 14 days at their own costs."
},
{
    "id": "ZW",
    "name": "Zimbabwe"
},
{
    "id": "XS",
    "name": "Somaliland"
}]
